/**
* 整个字典对象为一个json对象，具体的某个单独字典为json对象中的一个键，值的格式为二维数组，二维数组为[码值，描述]的组合
*/
var enterDict={
	//身份类别
	infoIdType : [
		['1', '自然人'],
		['2', '组织机构']
	],
	//企业身份标识类型
	arlpCertType : [
		['01','工商注册号'],
		['02','事业单位证书号'],
		['03','社会团体登记号'],
		['04','民办非企业登记号'],
		['05','基金会登记号'],
		['06','宗教证书登记号'],
		['10', '中征码（原贷款卡编码）'],
		['20', '统一社会信用代码'],
		['30', '组织机构代码'],
		['41','纳税人识别号（国税）'],
		['42','纳税人识别号（地税）']
	],
	//企业身份标识类型
	entCertMainType : [
		['10', '中征码（原贷款卡编码）'],
		['20', '统一社会信用代码'],
		['30', '组织机构代码']
	],
	//个人证件类型
	idType : [
		['1', '户口簿'],
		['2', '护照'],
		['5', '港澳居民来往内地通行证'],
		['6', '台湾同胞来往内地通行证'],
		['8', '外国人居留证'],
		['9', '警官证'],
		['A', '香港身份证'],
		['B', '澳门身份证'],
		['C', '台湾身份证'],
		['X', '其他证件'],
		['10', '居民身份证及其他以公民身份证号为标识的证件'],
		['20', '军人身份证件']
	],
	//授信协议额度循环标志
	creditLimType : [
		['0', '否'],
		['1', '是']
	],
	//授信协议额度状态
	creditConStatus : [
		['1', '有效'],
		['2', '到期/失效']
	],
	//信息记录类型
	infRecType : [
		['310', '企业基本信息记录'],
		['340', '企业身份标识整合信息记录'],
		['314', '企业基本信息整笔删除请求记录'],
		['610', '企业资产负债表信息记录  '],
		['620', '企业利润及利润分配表信息记录'],
		['630', '企业现金流量表信息记录  '],
		['614', '企业资产负债表整笔删除请求记录'],
		['624', '企业利润及利润分配表整笔删除请求记录'],
		['634', '企业现金流量表整笔删除请求记录'],
		['440', '企业担保账户信息记录'],
		['442', '企业担保账户按段更正请求记录'],
		['443', '企业担保账户按段删除请求记录'],
		['444', '企业担保账户整笔删除请求记录'],
		['410', '企业借贷账户信息记录'],
		['412', '企业借贷账户按段更正请求记录'],
		['413', '企业借贷账户按段删除请求记录'],
		['414', '企业借贷账户整笔删除请求记录'],
		['420', '企业授信协议信息记录'],
		['422', '企业授信协议按段更正请求记录'],
		['423', '企业授信协议按段删除请求记录'],
		['424', '企业授信协议整笔删除请求记录'],
		['350', '企业间关联关系信息记录 '],
		['640', '事业单位资产负债表信息记录'],
		['654', '事业单位收入支出表整笔删除请求记录'],
		['644', '事业单位资产负债表整笔删除请求记录'],
		['650', '事业单位收入支出表信息记录']
	],
	//正常报文类型
	reportMessageType : [
		['310', '企业基本信息记录'], 
		['350', '企业间关联关系信息记录 '],
		['410', '企业借贷账户信息记录'],
		['420', '企业授信协议信息记录'],
		['440', '企业担保账户信息记录'],
		['610', '企业资产负债表信息记录  '],
		['620', '企业利润及利润分配表信息记录'],
		['630', '企业现金流量表信息记录  '],
		['640', '事业单位资产负债表信息记录'],
		['650', '事业单位收入支出表信息记录']
	],
	//报送报文状态
  	reportMessageStatus : [
		['10', '待预处理 '],
		['20', '已弃用'],
		['30', '报送成功'],
		['40', '反馈全出错'],
		['41', '反馈成功'],
		['50', '反馈部分出错'],
		['60', '预处理成功'],
		['70', '预处理全失败'],
		['80', '预处理部分失败']        
  ],
	//企业基本信息报告时点说明
	eaaRptDateCode : [
		['10', '10-新增客户资料/首次上报'],
		['20', '20-更新客户资料']
	],
	//企业客户资料类型
	entCustomerType : [
		['1', '基本存款账户客户资料'],
		['2', '授信业务客户资料'],
		['X', '未知']
	],
	//企业基本信息存续状态
	etpSts : [
		['1', '正常营业（处于正常经营状态)'],
		['2', '注销'],
		['9', '其他'],
		['X', '未知']
	],
	//主要组成人员职位
	mmbPstn : [
		['1', '法定代表人/非法人组织负责人'],
		['2', '总经理/主要负责人'],
		['3', '财务负责人'],
		['4', '董事长/执行董事'],
		['5', '监事长/执行监事'],
		['9', '其他董事、监事及高级管理人员']
	],
	//出资人类型
	sharHodType : [
		['10', '10-股东'],
		['21', '21-普通合伙人'],
		['22', '22-有限合伙人'],
		['30', '30-个体工商户参与经营者']
	],
	//标识变更类型
	infRecTypeM :[
		['411', '企业借贷账户标识变更请求记录'],
		['421', '企业授信协议标识变更请求记录'],
		['441', '企业担保账户标识变更请求记录']
	],
	//企业更正类报文类型
	entAbnlMesPage :[ 
		['340', '340-企业身份标识整合信息记录'],
		['350', '350-企业间关联关系信息记录 '],
		['314', '314-企业基本信息整笔删除请求记录'],
		['411', '411-企业借贷账户标识变更请求记录'],
		['412', '412-企业借贷账户按段更正请求记录'],
		['413', '413-企业借贷账户按段删除请求记录'],
		['414', '414-企业借贷账户整笔删除请求记录'],
		['421', '421-企业授信协议标识变更请求记录'],
		['422', '422-企业授信协议按段更正请求记录'],
		['423', '423-企业授信协议按段删除请求记录'],
		['424', '424-企业授信协议整笔删除请求记录'],
		['441', '441-企业担保账户标识变更请求记录'],
		['442', '442-企业担保账户按段更正请求记录'],
		['443', '443-企业担保账户按段删除请求记录'],
		['444', '444-企业担保账户整笔删除请求记录'],
		['614', '614-企业资产负债表整笔删除请求记录'],
		['624', '624-企业利润及利润分配表整笔删除请求记录'],
		['634', '634-企业现金流量表整笔删除请求记录'],
		['644', '644-事业单位资产负债表整笔删除请求记录'],
		['654', '654-事业单位收入支出表整笔删除请求记录']
	],
	//删除类信息记录类型
	entDelMesPage : [
		['314', '314-企业基本信息整笔删除请求记录'],
		['413', '413-企业借贷账户按段删除请求记录'],
		['414', '414-企业借贷账户整笔删除请求记录'],
		['423', '423-企业授信协议按段删除请求记录'],
		['424', '424-企业授信协议整笔删除请求记录'],
		['443', '443-企业担保账户按段删除请求记录'],
		['444', '444-企业担保账户整笔删除请求记录'],
		['614', '614-企业资产负债表整笔删除请求记录'],
		['624', '624-企业利润及利润分配表整笔删除请求记录'],
		['634', '634-企业现金流量表整笔删除请求记录'],
		['644', '644-事业单位资产负债表整笔删除请求记录'],
		['654', '654-事业单位收入支出表整笔删除请求记录']
	],
	
	//上级机构类型
	supOrgType : [
		['1', '集团母公司'],
		['2', '总部机构']
	],
	//企业身份标识关系有效标志
	entCertTypeSign : [
		['0', '0-无效（代表两个身份标识之间的关联系无效）'],
		['1', '1-有效（代表两个身份标识之间的关联系有效）']
	],
	//企业关联关系类型
	entAssoType : [
		['21', '除本企业的股东外，直接或间接控制本企业的关联企业'],
		['22', '本企业直接或间接控制的关联企业'],
		['23', '直接或间接被同一控制方控制的关联企业'],
		['24', '符合《企业会计制度》第147条规定的其他关联企业']
	],
	//企业关联关系有效标志
	entAssoSign : [
		['0', '无效（代表两个企业之间的关联关系无效）'],
		['1', '有效（代表两个企业之间的关联关系有效）']
	],
	//组织机构类型
	orgType : [
		['1	', '企业'],
		['11', '11-公司'],
		['13', '13-非公司制企业法人'],
		['15', '15-企业分支机构'],
		['17', '17-个人独资企业、合伙企业'],
		['19', '19-其他企业'],
		['3	', '机关'],
		['31', '31-中国共产党'],
		['32', '32-国家权力机关法人'],
		['33', '33-国家行政机关法人'],
		['34', '34-国家司法机关法人'],
		['35', '35-政协组织'],
		['36', '36-民主党派'],
		['37', '37-人民解放军、武警部队'],
		['39', '39-其他机关'],
		['5	', '事业单位'],
		['51', '51-事业单位法人'],
		['53', '53-事业单位分支、派出机构'],
		['59', '59-其他事业单位'],
		['7	', '社会团体'],
		['71', '71-社会团体法人'],
		['73', '73-社会团体分支、代表机构'],
		['79', '79-其他社会团体'],
		['9	', '其他组织机构'],
		['91', '91-民办非企业单位'],
		['93', '93-基金会'],
		['94', '94-宗教活动场所'],
		['95', '95-农村村民委员会'],
		['96', '96-城市居民委员会'],
		['97', '97-自定义区'],
		['99', '99-其他未列明的组织机构'],
		['A	', '个体工商户']
	],
	//经济类型
	ecoType : [
		['100', '100-内资'],
		['110', '110-国有全资'],
		['120', '120-集体全资'],
		['130', '130-股份合作'],
		['140', '140-联营'],
		['141', '141-国有联营'],
		['142', '142-集体联营'],
		['143', '143-国有与集体联营'],
		['149', '149-其他联营'],
		['150', '150-有限责任(公司)'],
		['159', '159-其他有限责任(公司)'],
		['160', '160-股份有限(公司)'],
		['170', '170-私有'],
		['171', '171-私有独资'],
		['172', '172-私有合伙'],
		['173', '173-私营有限责任(公司)'],
		['174', '174-私营股份有限(公司)'],
		['175', '175-个体经营'],
		['179', '179-其他私有'],
		['190', '190-其他内资'],
		['200', '200-港、澳、台投资'],
		['210', '210-内地和港、澳或台合资'],
		['220', '220-内地和港、澳或台合作'],
		['230', '230-港、澳或台独资'],
		['240', '240-港、澳或台投资股份有限(公司)'],
		['290', '290-其他港澳台投资'],
		['300', '300-国外投资'],
		['310', '310-中外合资'],
		['320', '320-中外合作'],
		['330', '330-外资'],
		['340', '340-国外投资股份有限(公司)'],
		['390', '390-其他国外投资'],
		['900', '900-其他']
	],
	//企业规模
	entScale : [
		['2', '大型企业'],
		['3', '中型企业'],
		['4', '小型企业'],
		['5', '微型企业'],
		['9', '无需划型'],
		['X', '未知']
	],
	//企业标识变更请求记录
	entInfrectypeAccount : [
		['441', '441-企业担保账户标识变更请求记录'],
		['421', '421-企业授信协议标识变更请求记录'],
		['411', '411-企业借贷账户标识变更请求记录']
	],
	//企业借贷账户类型
	enLoanAcctType : [
		['D1', '非循环贷账户'],
		['D2', '贴现账户'],
		['R1', '循环贷账户'],
		['R4', '循环额度下分账户'],
		['C1', '催收账户']
	],
	//企业借贷账户报告时点说明
	entLoanRptDateCode : [
		['10', '10-新开户/首次报送'],
		['20', '20-账户关闭'],
		['31', '31-开户后放款'],
		['32', '32-约定还款日结算'],
		['33', '33-实际还款'],
		['41', '41-五级分类调整'],
		['42', '42-展期发生'],
		['49', '49-其他情况']
	],
	//企业借贷交易业务大类
	entLoanBusiLines : [
		['10', '10-企业债'],
		['11', '11-贷款'],
		['12', '12-贸易融资'],
		['13', '13-保理融资'],
		['14', '14-融资租赁'],
		['15', '15-证券类融资'],
		['16', '16-透支'],
		['21', '21-票据贴现'],
		['31', '31-黄金借贷'],
		['41', '41-垫款'],
		['51', '51-资产处置']
	],
	//企业借贷交易业务种类细分（企业债）
	entLoanBusiDtlLines10 : [
		['10', '10-非金融企业债务融资工具'],
		['20', '20-上市公司债'],
		['30', '30-发改委审核发行企业债'],
		['90', '90-其他公司信用债']                  
	],
	//企业借贷交易业务种类细分（贷款）
	entLoanBusiDtlLines11 : [
		['11', '11-流动资金贷款'],
		['12', '12-固定资产贷款'],
		['13', '13-境外筹资转贷款'],
		['14', '14-国内买方信贷'],
		['15', '15-出口卖方信贷'],
		['16', '16-项目融资'],
		['17', '17-并购贷款'],
		['90', '90-其他贷款'],
		['18', '18-创业担保贷款']                     
	],
	//企业借贷交易业务种类细分（贸易融资）
	entLoanBusiDtlLines12 : [
		['11', '11-进口押汇'],
		['19', '19-其他进口类融资'],
		['21', '21-出口打包放款'],
		['22', '22-出口押汇'],
		['23', '23-出口票据贴现'],
		['25', '25-国际订单融资'],
		['29', '29-其他出口类融资（不含保理）'],
		['31', '31-国内买方押汇'],
		['39', '39-其他国内买方融资'],
		['41', '41-国内打包贷款'],
		['42', '42-国内订单融资'],
		['43', '43-国内卖方押汇'],
		['49', '49-其他国内卖方融资（不含保理）']
	],
	//企业借贷交易业务种类细分（保理融资）
	entLoanBusiDtlLines13 : [
		['10', '10-有追索权的出口保理融资'],
		['20', '20-有追索权的国内卖方保理融资']
	],
	//企业借贷交易业务种类细分（融资租赁）
	entLoanBusiDtlLines14 : [
	    ['10', '10-融资型租赁']                   
	],
	//企业借贷交易业务种类细分（证券类融资）
	entLoanBusiDtlLines15 : [
		['10', '10-约定购回式证券交易'],
		['20', '20-股票质押融资'],
		['90', '90-其他证券类融资']
	],
	//企业借贷交易业务种类细分（透支）
	entLoanBusiDtlLines16 : [
		['10', '10-法人账户透支'],
		['20', '20-支票账户透支']
	],
	//企业借贷交易业务种类细分（票据贴现）
	entLoanBusiDtlLines21 : [
		['10', '10-有追索权的银行承兑汇票贴现'],
		['20', '20-有追索权的商业承兑汇票贴现']
	],
	//企业借贷交易业务种类细分（黄金借贷）
	entLoanBusiDtlLines31 : [
		['10', '10-黄金借贷']
	],
	//企业借贷交易业务种类细分（垫款）
	entLoanBusiDtlLines41 : [
		['10', '10-保函垫款'],
		['20', '20-承兑汇票垫款'],
		['30', '30-信用证垫款'],
		['40', '40-保理垫款'],
		['50', '50-担保代偿'],
		['90', '90-其他垫款']
	],
	//企业借贷交易业务种类细分（资产处置）
	entLoanBusiDtlLines51 : [
		['10', '10-资产处置']
	],
	//企业借贷账户还款方式（R1账户）
	entLoanRepayModeR1 : [
		['31', '31-按期结息，到期还本'],
		['32', '32-按期结息，自由还本'],
		['33', '33-按期计算还本付息'],
		['39', '39-循环贷款下其他还款方式'],
		['90', '90-汇总报送，不区分还款方式']
	],
	//企业借贷账户还款方式（R4账户）
	entLoanRepayModeR4 : [
		['11', '11-分期等额本息'],
		['12', '12-分期等额本金'],
		['13', '13-到期还本分期结息'],
		['14', '14-等比累进分期还款'],
		['15', '15-等额累进分期还款'],
		['19', '19-其他类型分期还款'],
		['21', '21-到期一次还本付息'],
		['22', '22-预先付息到期还本'],
		['23', '23-随时还'],
		['29', '29-其他类型非分期还款']
	],
	//企业借贷账户还款方式（D1账户）
	entLoanRepayModeD1 : [
		['11', '11-分期等额本息'],
		['12', '12-分期等额本金'],
		['13', '13-到期还本分期结息'],
		['14', '14-等比累进分期还款'],
		['15', '15-等额累进分期还款'],
		['19', '19-其他类型分期还款'],
		['21', '21-到期一次还本付息'],
		['22', '22-预先付息到期还本'],
		['23', '23-随时还'],
		['29', '29-其他类型非分期还款'],
		['90', '90-汇总报送，不区分还款方式']
	],
	//企业借贷账户还款频率
	entLoanRepayFreqcy : [
		['10', '10-月'],
		['21', '21-双月'],
		['22', '22-季'],
		['23', '23-半年'],
		['24', '24-年'],
		['29', '29-其它大于月的频率'],
		['39', '39-其他小于月的频率'],
		['40', '40-不定期'],
		['90', '90-其他']          
	],
	//企业借贷账户担保方式
	entLoanGuarMode : [
		['0', '信用/免担保'],
		['1', '保证'],
		['2', '质押'],
		['3', '抵押'],
		['4', '组合']
	],
	//企业借贷账户其他还款保证方式
	entLoanOthRepyGuarWay : [
		['0', '无  '],
		['1', '保证金'],
		['2', '第三方付款承诺'],
		['9', '其他']
	],
	//企业借贷账户借款期限分类
	entLoanTimeLimCat : [
		['10', '10-短期（借款期限1年以内（含1年）的借款）'],
		['20', '20-中期（借款期限1年以上5年（含）以下的借款)'],
		['30', '30-长期（借款期限5年（不含）以上的借款）']
	],
	//企业贷款发放形式
	entLoaFrm : [
		['1', '新增'],
		['2', '收回再贷'],
		['3', '借新还旧'],
		['4', '资产重组'],
		['5', '其他机构转入'],
		['9', '其他']
	],
	//企业借贷账户业务经营类型
	entLoanFundSou : [
		['1', '1-自营'],
		['2', '2-委托'],
		['21', '21-政府部门委托'],
		['22', '22-企事业单位委托'],
		['23', '23-个人委托'],
		['24', '24-住房公积金管理中心的委托'],
		['4', '4-信托'],
		['8', '8-联合']
	],
	//企业借贷账户相关还款责任人
	entLoanArlpType : [
		['1', '共同借款人'],
		['2', '保证人'],
		['3', '票据承兑人'],
		['4', '应收账款债务人'],
		['5', '供应链中核心企业'],
		['9', '其他']
	],
	//企业借贷账户联保标志
	entLoanWartySign : [
		['0', '单人保证/多人分保'],
		['1', '联保']
	],
	
	//企业借贷账户原债务种类
	entLoanOrigDbtCate : [
		['10', '10-企业债'],
		['11', '11-贷款'],
		['12', '12-贸易融资'],
		['13', '13-保理融资'],
		['14', '14-融资租赁'],
		['15', '15-证券类融资'],
		['16', '16-透支'],
		['21', '21-票据贴现'],
		['31', '31-黄金借贷'],
		['41', '41-垫款'],
		['90', '90-其他']
	],
	//企业借贷账户状态
	entLoanAcctStatus : [
		['10', '10-正常活动'],
		['21', '21-关闭'],
		['31', '31-呆账（已核销）'],
		['32', '32-呆账（进入核销认定程序，等待核销）']
	],
	//企业借贷账户还款形式
	entLoanRpmtType : [
		['10', '10-正常还款'],
		['21', '21-担保代偿'],
		['22', '22-政策性还款'],
		['31', '31-资产重组'],
		['32', '32-减免（适用于资产管理公司）'],
		['41', '41-债权转让'],
		['42', '42-债权置换'],
		['51', '51-债转股  '],
		['52', '52-以资抵债'],
		['61', '61-诉讼追偿'],
		['62', '62-破产清偿'],
		['63', '63-委托处置'],
		['99', '99-其他']
	],
	//企业借贷账户特殊交易类型
	entLoanChanTranType : [
		['11', '11-展期'],
		['12', '12-提前还款'],
		['21', '21-核损核销']
	],
	//企业借贷账户信息记录段标
	entLoanInfRecType : [
		['B', '基础段'],
		['C', '基本信息段'],
		['D', '相关还款责任人段'],
		['E', '抵质押物信息段'],
		['F', '授信额度信息段'],
		['G', '初始债权说明段'],
		['H', '还款表现信息段'],
		['I', '特定交易说明段']
	],
	//企业担保账户类型
	entGuarAcctType : [
		['G1', '融资担保账户'],
		['G2', '非融资担保账户'],
		['G3', '支付担保账户']
	],
	//企业担保账户报告时点说明
	entGuarRptDateCode : [
		['10', '10-新开户/首次上报'],
		['20', '20-账户关闭'],
		['30', '30-在保责任变化'],
		['40', '40-五级分类调整'],
		['50', '50-其他信息变化']
	 ],
	//企业担保交易业务大类
	 entGuarBusiLines : [
		['1', '融资担保'],
		['2', '非融资担保'],
		['3', '再担保'],
		['4', '保证保险'],
		['5', '信用证'],
		['6', '承兑汇票'],
		['7', '银行保函']
	 ],
	 //企业担保交易业务种类细分
	 entGuarBusiDtilLines : [
		['01', '01-贷款担保'],
		['02', '02-票据承兑担保'],
		['03', '03-贸易融资担保'],
		['04', '04-项目融资担保'],
		['05', '05-信用证融资担保'],
		['06', '06-其他融资担保'],
		['07', '07-诉讼保全担保'],
		['08', '08-履约担保'],
		['09', '09-其他非融资担保'],
		['10', '10-债券发行担保'],
		['11', '11-再担保'],
		['12', '12-贷款保证保险'],
		['51', '51-信用证'],
		['61', '61-银行承兑汇票'],
		['62', '62-商业承兑汇票'],
		['71', '71-融资类银行保函'],
		['72', '72-非融资类银行保函']
	 ],
	//企业担保账户反担保方式
	 entGuarGuarMode : [
		['0', '信用/免担保'],
		['1', '保证'],
		['2', '质押'],
		['3', '抵押'],
		['4', '组合']
	 ],
	 //企业担保账户其他还款保证方式
	 entGuarOthRepyGuarWay : [
		['0', '无'],
		['1', '保证金'],
		['2', '第三方付款承诺'],
		['9', '其他']
	 ],
	 //企业担保账户相关还款责任人类型
	 entGuarArlpType : [
		['1', '共同债务人'],
		['2', '反担保人'],
		['9', '其他']
	 ],
	 //企业担保账户联保标志
	 entGuarWartySign : [
		['0	', '单人保证/多人分保'],
		['1	', '联保']
	 ],
	 //数据状态、
	 dataStatusBlxs : [
   	    ['11','11-待校验'],
		['10','10-校验失败'],
		['20','20-校验成功'],
		['30','30-审核通过'],
		['40','40-审核拒绝'],
		['50','50-已生成报文'],
		['60','60-已上报'],
		['70','70-上报成功'],
		['80','80-反馈错误'],
		['85','85-审核成功后生成报文中前'],
		['90','90-生成报文中'],
		['100','100-审核中'],
		['110','110-预处理错误'],
		['120','120-预处理成功']
	],
	 //企业担保账户状态
	 entGuarAcctStatus : [
		['1', '正常'],
		['2', '关闭']
	 ],
	 //企业担保账户信息记录段段标
	 entGuarUpInfRecType : [
		['B', '基础段'],
		['C', '基本信息段'],
		['D', '在保责任信息段'],
		['E', '相关还款责任人段'],
		['F', '抵质押物信息段'],
		['G', '授信额度信息段']
	 ],
	 //报表类型
	 sheetType : [
		['10', '10-年报'],
		['20', '20-上半年'],
		['30', '30-下半年'],
		['40', '40-第一季度'],
		['50', '50-第二季度'],
		['60', '60-第三季度'],
		['70', '70-第四季度'],
	 ],
	 //企业财务报表报告时点说明
	 entBalanceInfRecType : [
		['10', '10-获取财务报表'],
		['20', '20-更新财务报表']
	 ],
	 //企业财务报表类型细分
	 entBalanceSheetTypeDivide : [
		['1', '本部报表'],
		['2', '合并报表']
	 ],
	 //企业授信协议报告时点说明
	 entCreditRptDateCode : [
		['10', '10-授信开始'],
		['20', '20-授信到期/失效'],
		['30', '30-额度调整']
	 ],
	 //企业授信协议额度类型
	 entCreditLimType : [
		['11', '11-贷款'],
		['12', '12-贸易融资'],
		['13', '13-保理融资'],
		['15', '15-证券类融资'],
		['16', '16-透支'],
		['31', '31-黄金借贷'],
		['41', '41-信用证额度'],
		['51', '51-承兑汇票额度']
	 ],
	 //企业授信协议信息记录段标
	 entCreditUpInfRecType : [
		['B', '基础段'],
		['C', '共同受信人信息段'],
		['D', '额度信息段']                       
	 ],
	 //抵质押信息记录类型
	 motgaInfrectype : [
		['510', '抵（质）押合同信息记录'],
		['514', '抵（质）押合同整笔删除请求记录'],
		['511', '抵（质）押合同标识变更请求记录']
	 ],
	 //抵（质）押合同信息报告时点说明
	 ccRptDateCode : [
		['10', '10-合同生效'],
		['20', '20-合同到期/失效'],
		['30', '30-抵（质）押物变更']
	 ],
	 //抵（质）押合同类型
	 ccGuarType : [
		['1', '抵押合同'],
		['2', '质押合同']
	 ],
	 //最高额担保标志
	 ccMaxGuar : [
		['0', '否'],
		['1', '是']
	 ],
	 //抵（质）押合同状态
	 ccStatus : [
		['1', '有效'],
		['2', '到期/失效']
	 ],
	 //抵押物种类
	 ccPleType : [
		['11', '11-房产'],
		['12', '12-土地使用权（包含土地附着物）'],
		['13', '13-交通运输设备'],
		['14', '14-机器设备'],
		['99', '99-其他']
	 ],
	 //抵押物识别号码类型
	 ccMotgaProptIdtype : [
		['1', '房产权证号'],
		['2', '土地使用权证书号'],
		['3', '建设用地规划许可证号'],
		['4', '交通工具发动机号'],
		['5', '交通工具营运执照号'],
		['6', '机器设备规格型号']
	 ],
	 //评估机构类型
	 ccValOrgType : [
		['1', '自评估'],
		['2', '第三方机构评估']
	 ],
	 //质物种类代码 
	 ccImpType : [
		['11', '11-现金及其等价物'],
		['12', '12-票据'],
		['13', '13-保单'],
		['14', '14-债券'],
		['15', '15-股权'],
		['21', '21-基金'],
		['22', '22-贵金属'],
		['23', '23-应收账款'],
		['24', '24-流动资产'],
		['25', '25-无形资产'],
		['26', '26-涉农质物'],
		['90', '90-其他']
	 ],
	//币种
		ccy : [
				['ADP','安道尔比塞塔'],
				['AED','UAE迪拉姆'],
				['AFA','阿富汗尼'],
				['ALL','列克'],
				['AMD','亚美尼亚达姆'],
				['ANG','荷属安的列斯盾'],
				['AOA','宽扎'],
				['ARS','阿根廷比索'],
				['ATS','先令'],
				['AUD','澳大利亚元'],
				['AWG','阿鲁巴盾'],
				['AZM','阿塞拜疆马纳特'],
				['BAM','可自由兑换标记'],
				['BBD','巴巴多斯元'],
				['BDT','塔卡'],
				['BEF','比利时法郎'],
				['BGL','列弗'],
				['BGN','保加利亚列弗'],
				['BHD','巴林第纳尔'],
				['BIF','布隆迪法郎'],
				['BMD','百慕大元'],
				['BND','文莱元'],
				['BOB','玻利瓦尔'],
				['BOV','Mvdol'],
				['BRL','巴西瑞尔'],
				['BSD','巴哈马元'],
				['BTN','努尔特鲁姆'],
				['BWP','普拉'],
				['BYR','白俄罗斯卢布'],
				['BZD','伯利兹元'],
				['CAD','加元'],
				['CDF','刚果法郎'],
				['CHF','瑞士法郎'],
				['CLF','发展单位'],
				['CLP','智利比索'],
				['CNY','人民币元'],
				['COP','哥伦比亚比索'],
				['CRC','哥斯达黎加科朗'],
				['CUP','古巴比索'],
				['CVE','佛得角埃斯库多'],
				['CYP','塞浦路斯镑'],
				['CZK','捷克克朗'],
				['DEM','德国马克'],
				['DJF','即菩提法郎'],
				['DKK','丹麦克朗'],
				['DOP','多米尼加比索'],
				['DZD','阿尔及利亚第纳尔'],
				['EEK','克罗姆'],
				['EGP','埃及镑'],
				['ERN','纳克法'],
				['ESP','西班牙比塞塔'],
				['ETB','埃塞俄比亚比尔'],
				['EUR','欧元'],
				['FIM','马克'],
				['FJD','斐济元'],
				['FKP','福克兰群岛镑'],
				['FRF','法国法郎'],
				['GBP','英镑'],
				['GEL','拉里'],
				['GHC','赛地'],
				['GIP','直布罗陀镑'],
				['GMD','达拉西'],
				['GNF','几内亚法郎'],
				['GRD','德拉克马'],
				['GTQ','格查尔'],
				['GWP','几内亚比绍比索'],
				['GWD','圭亚那元'],
				['HKD','香港元'],
				['HNL','伦皮拉'],
				['HRK','克罗地亚库纳'],
				['HTG','古德'],
				['HUF','福林'],
				['IDR','卢比'],
				['IEP','爱尔兰镑'],
				['ILS','新谢克尔'],
				['INR','印度卢比'],
				['IQD','伊拉克第纳尔'],
				['IRR','伊朗里亚尔'],
				['ISK','冰岛克朗'],
				['ITL','意大利里拉'],
				['JMD','牙买加元'],
				['JOD','约旦第纳尔'],
				['JPY','日元'],
				['KES','肯尼亚先令'],
				['KGS','索姆'],
				['KHR','瑞尔'],
				['KMF','科摩罗法郎'],
				['KPW','北朝鲜圆'],
				['KRW','圆'],
				['KWD','科威特第纳尔'],
				['KYD','开曼群岛元'],
				['KZT','坚戈'],
				['LAK','基普'],
				['LBP','黎巴嫩镑'],
				['LKR','斯里兰卡卢比'],
				['LRD','利比里亚元'],
				['LSL','罗提'],
				['LTL','立陶宛'],
				['LUF','卢森堡法郎'],
				['LVL','拉脱维亚拉特'],
				['LYD','利比亚第纳尔'],
				['MAD','摩洛哥迪拉姆'],
				['MDL','摩尔瓦多列伊'],
				['MGF','马尔加什法郎'],
				['MKD','第纳尔'],
				['MMK','缅元'],
				['MNT','图格里克'],
				['MOP','澳门元'],
				['MRO','乌吉亚'],
				['MTL','马尔他里拉'],
				['MUR','毛里求斯卢比'],
				['MVR','卢菲亚'],
				['MWK','克瓦查'],
				['MXN','墨西哥比索'],
				['MXV','墨西哥发展单位'],
				['MYR','马来西亚林吉特'],
				['MZM','麦梯卡尔'],
				['NAD','纳米比亚元'],
				['NGN','奈拉'],
				['NIO','金科多巴'],
				['NLG','荷兰盾'],
				['NOK','挪威克朗'],
				['NPR','尼泊尔卢比'],
				['NZD','新西兰元'],
				['OMR','阿曼里亚尔'],
				['PAB','巴波亚'],
				['PEN','索尔'],
				['PGK','基那'],
				['PHP','菲律宾比索'],
				['PKR','巴基斯坦卢比'],
				['PLN','兹罗提'],
				['PTE','葡萄牙埃斯库多'],
				['PYG','瓜拉尼'],
				['QAR','卡塔尔里亚尔'],
				['ROL','列伊'],
				['RUB','俄罗斯卢布'],
				['RUR','俄罗斯卢布'],
				['RWF','卢旺达法郎'],
				['SAR','沙特里亚尔'],
				['SBD','所罗门群岛元'],
				['SCR','塞舌尔卢比'],
				['SDD','苏丹第纳尔'],
				['SEK','瑞典克朗'],
				['SGD','新加坡元'],
				['SHP','圣赫勒拿镑'],
				['SIT','托拉尔'],
				['SKK','斯洛伐克克朗'],
				['SLL','利昂'],
				['SOS','索马里先令'],
				['SRG','苏里南盾'],
				['STD','多布拉'],
				['SVC','萨尔瓦多科朗'],
				['SYP','叙利亚镑'],
				['SZL','里兰吉尼'],
				['THB','铢'],
				['TJS','索莫尼'],
				['TMM','马纳特'],
				['TND','突尼斯第纳尔'],
				['TOP','邦加'],
				['TPE','东帝汶埃斯库多'],
				['TRL','土耳其里拉'],
				['TTD','特立尼达和多巴哥元'],
				['TWD','新台湾元'],
				['TZS','坦桑尼亚先令'],
				['UAH','格里夫纳'],
				['UGX','乌干达先令'],
				['USD','美元'],
				['UYU','乌拉圭比索'],
				['UZS','乌兹别克斯坦苏姆'],
				['VND','盾'],
				['VUV','瓦图'],
				['WST','塔拉'],
				['XAF','中非法郎'],
				['XAG','银'],
				['XAU','黄金'],
				['XBA','欧洲货币合成单位'],
				['XBB','欧洲货币单位(E.M.U.','6)'],
				['XBC','欧洲账户9单位'],
				['XBD','欧洲账户17单位'],
				['XCD','东加勒比元'],
				['XDR','特别提款权'],
				['XFO','黄金法郎'],
				['XFU','UIC法郎'],
				['XOF','CFA法郎BCEAO'],
				['XPF','CFP法郎'],
				['YER','也门里亚尔'],
				['YUM','南斯拉夫第纳尔'],
				['ZAR','兰特'],
				['ZMK','克瓦查'],
				['ZWD','津巴布韦元']
		],
		//国民经济行业分类
		industry : [
			['A', '农、林、牧、渔业'],
			['B', '采矿业'],
			['C', '制造业'],
			['D', '电力、热力、燃气及水生产和供应业'],
			['E', '建筑业'],
			['F', '批发和零售业'],
			['G', '交通运输、仓储和邮储业'],
			['H', '住宿和餐饮业'],
			['I', '信息传输、 软件和信息技术服务'],
			['J', '金融业'],
			['K', '房地产业'],
			['L', '租赁和商务服务业'],
			['M', '科学研究和技术服务业'],
			['N', '水利、环境和公共设施管理业'],
			['O', '居民服务、修理和其他服务业'],
			['P', '教育'],
			['Q', '卫生和社会工作'],
			['R', '文化、体育和娱乐业'],
			['S', '公共管理、社会保障和社会组织'],
			['T', '国际组织'],
			['9', '未知']
		],
		
		//世界各国和地区名称
		country : [
			['991', '中国（含港澳台）'],
			['992', '外国（不含港澳台）'],
			['999', '未知'],
			['ABW', '阿鲁巴'],
			['AFG', '阿富汗'],
			['AGO', '安哥拉'],
			['AIA', '安圭拉'],
			['ALB', '阿尔巴尼亚'],
			['AND', '安道尔'],
			['ANT', '荷属安的列斯'],
			['ARE', '阿联酋'],
			['ARG', '阿根廷'],
			['ARM', '亚美尼亚'],
			['ASM', '美属萨摩亚'],
			['ATA', '南极洲'],
			['ATF', '法属南部领土'],
			['ATG', '安提瓜和巴布达'],
			['AUS', '澳大利亚'],
			['AUT', '奥地利'],
			['AZE', '阿塞拜疆'],
			['BDI', '布隆迪'],
			['BEL', '比利时'],
			['BEN', '贝宁'],
			['BFA', '布基纳法索'],
			['BGD', '孟加拉国'],
			['BGR', '保加利亚'],
			['BHR', '巴林'],
			['BHS', '巴哈马'],
			['BIH', '波黑'],
			['BLR', '白俄罗斯'],
			['BLZ', '伯利兹'],
			['BMU', '百慕大'],
			['BOL', '玻利维亚'],
			['BRA', '巴西'],
			['BRB', '巴巴多斯'],
			['BRN', '文莱'],
			['BTN', '不丹'],
			['BVT', '布维岛'],
			['BWA', '博茨瓦纳'],
			['CAF', '中非'],
			['CAN', '加拿大'],
			['CCK', '科科斯(基林)群岛'],
			['CHE', '瑞士'],
			['CHL', '智利'],
			['CHN', '中国'],
			['CIV', '科特迪瓦'],
			['CMR', '喀麦隆'],
			['COD', '刚果（金）'],
			['COG', '刚果(布)'],
			['COK', '库克群岛'],
			['COL', '哥伦比亚'],
			['COM', '科摩罗'],
			['CPV', '佛得角'],
			['CRI', '哥斯达黎加'],
			['CUB', '古巴'],
			['CXR', '圣诞岛'],
			['CYM', '开曼群岛'],
			['CYP', '塞浦路斯'],
			['CZE', '捷克'],
			['DEU', '德国'],
			['DJI', '吉布提'],
			['DMA', '多米尼克'],
			['DNK', '丹麦'],
			['DOM', '多米尼加'],
			['DZA', '阿尔及利亚'],
			['ECU', '厄瓜多尔'],
			['EGY', '埃及'],
			['ERI', '厄立特里亚'],
			['ESH', '西撒哈拉'],
			['ESP', '西班牙'],
			['EST', '爱沙尼亚'],
			['ETH', '埃塞俄比亚'],
			['FIN', '芬兰'],
			['FJI', '斐济'],
			['FLK', '福克兰群岛（马尔维纳斯）'],
			['FRA', '法国'],
			['FRO', '法罗群岛'],
			['FSM', '密克罗尼西亚联邦'],
			['GAB', '加蓬'],
			['GBR', '英国'],
			['GEO', '格鲁吉亚'],
			['GHA', '加纳'],
			['GIB', '直布罗陀'],
			['GIN', '几内亚'],
			['GLP', '瓜德罗普'],
			['GMB', '冈比亚'],
			['GNB', '几内亚比绍'],
			['GNQ', '赤道几内亚'],
			['GRC', '希腊'],
			['GRD', '格林纳达'],
			['GRL', '格陵兰'],
			['GTM', '危地马拉'],
			['GUF', '法属圭亚那'],
			['GUM', '关岛'],
			['GUY', '圭亚那'],
			['HKG', '香港'],
			['HMD', '赫德岛和麦克唐纳岛'],
			['HND', '洪都拉斯'],
			['HRV', '克罗地亚'],
			['HTI', '海地'],
			['HUN', '匈牙利'],
			['IDN', '印度尼西亚'],
			['IND', '印度'],
			['IOT', '英属印度洋领地'],
			['IRL', '爱尔兰'],
			['IRN', '伊朗'],
			['IRQ', '伊拉克'],
			['ISL', '冰岛'],
			['ISR', '以色列'],
			['ITA', '意大利'],
			['JAM', '牙买加'],
			['JOR', '约旦'],
			['JPN', '日本'],
			['KAZ', '哈萨克斯坦'],
			['KEN', '肯尼亚'],
			['KGZ', '吉尔吉斯斯坦'],
			['KHM', '柬埔寨'],
			['KIR', '基里巴斯'],
			['KNA', '圣基茨和尼维斯'],
			['KOR', '韩国'],
			['KWT', '科威特'],
			['LAO', '老挝'],
			['LBN', '黎巴嫩'],
			['LBR', '利比里亚'],
			['LBY', '利比亚'],
			['LCA', '圣卢西亚'],
			['LIE', '列支敦士登'],
			['LKA', '斯里兰卡'],
			['LSO', '莱索托'],
			['LTU', '立陶宛'],
			['LUX', '卢森堡'],
			['LVA', '拉脱维亚'],
			['MAC', '澳门'],
			['MAR', '摩洛哥'],
			['MCO', '摩纳哥'],
			['MDA', '摩尔多瓦'],
			['MDG', '马达加斯加'],
			['MDV', '马尔代夫'],
			['MEX', '墨西哥'],
			['MHL', '马绍尔群岛'],
			['MKD', '前南马其顿'],
			['MLI', '马里'],
			['MLT', '马耳他'],
			['MMR', '缅甸'],
			['MNG', '蒙古'],
			['MNP', '北马里亚纳'],
			['MOZ', '莫桑比克'],
			['MRT', '毛里塔尼亚'],
			['MSR', '蒙特赛拉特'],
			['MTQ', '马提尼克'],
			['MUS', '毛里求斯'],
			['MWI', '马拉维'],
			['MYS', '马来西亚'],
			['MYT', '马约特'],
			['NAM', '纳米比亚'],
			['NCL', '新喀里多尼亚'],
			['NER', '尼日尔'],
			['NFK', '诺福克岛'],
			['NGA', '尼日利亚'],
			['NIC', '尼加拉瓜'],
			['NIU', '纽埃'],
			['NLD', '荷兰'],
			['NOR', '挪威'],
			['NPL', '尼泊尔'],
			['NRU', '瑙鲁'],
			['NZL', '新西兰'],
			['OMN', '阿曼'],
			['OTH', '其他地区'],
			['PAK', '巴基斯坦'],
			['PAN', '巴拿马'],
			['PCN', '皮特凯恩'],
			['PER', '秘鲁'],
			['PHL', '菲律宾'],
			['PLW', '帕劳'],
			['PNG', '巴布亚新几内亚'],
			['POL', '波兰'],
			['PRI', '波多黎各'],
			['PRK', '朝鲜'],
			['PRT', '葡萄牙'],
			['PRY', '巴拉圭'],
			['PSE', '巴勒斯坦'],
			['PYF', '法属波利尼西亚'],
			['QAT', '卡塔尔'],
			['REU', '留尼汪'],
			['ROM', '罗马尼亚'],
			['RUS', '俄罗斯联邦'],
			['RWA', '卢旺达'],
			['SAU', '沙特阿拉伯'],
			['SDN', '苏丹'],
			['SEN', '塞内加尔'],
			['SGP', '新加坡'],
			['SGS', '南乔治亚岛和南桑德韦奇岛'],
			['SHN', '圣赫勒拿'],
			['SJM', '斯瓦尔巴岛和扬马延岛'],
			['SLB', '所罗门群岛'],
			['SLE', '塞拉里昂'],
			['SLV', '萨尔瓦多'],
			['SMR', '圣马力诺'],
			['SOM', '索马里'],
			['SPM', '圣皮埃尔和密克隆'],
			['STP', '圣多美和普林西比'],
			['SUR', '苏里南'],
			['SVK', '斯洛伐克'],
			['SVN', '斯洛文尼亚'],
			['SWE', '瑞典'],
			['SWZ', '斯威士兰'],
			['SYC', '塞舌尔'],
			['SYR', '叙利亚'],
			['TCA', '特克斯和凯科斯群岛'],
			['TCD', '乍得'],
			['TGO', '多哥'],
			['THA', '泰国'],
			['TJK', '塔吉克斯坦'],
			['TKL', '托克劳'],
			['TKM', '土库曼斯坦'],
			['TMP', '东帝汶'],
			['TON', '汤加'],
			['TTO', '特立尼达和多巴哥'],
			['TUN', '突尼斯'],
			['TUR', '土耳其'],
			['TUV', '图瓦卢'],
			['TWN', '台湾'],
			['TZA', '坦桑尼亚'],
			['UGA', '乌干达'],
			['UKR', '乌克兰'],
			['UMI', '美国本土外小岛屿'],
			['URY', '乌拉圭'],
			['USA', '美国'],
			['UZB', '乌兹别克斯坦'],
			['VAT', '梵蒂冈'],
			['VCT', '圣文森特和格林纳丁斯'],
			['VEN', '委内瑞拉'],
			['VGB', '英属维尔京群岛'],
			['VIR', '美属维尔京群岛'],
			['VNM', '越南'],
			['VUT', '瓦努阿图'],
			['WLF', '瓦利斯和富图纳'],
			['WSM', '萨摩亚'],
			['YEM', '也门'],
			['YUG', '南斯拉夫'],
			['ZAF', '南非'],
			['ZMB', '赞比亚'],
			['ZWE', '津巴布韦']		
		]
		
	 
	 
};
