/**
* 整个字典对象为一个json对象，具体的某个单独字典为json对象中的一个键，值的格式为二维数组，二维数组为[码值，描述]的组合
*/
var staticDict = {
	//校验规则业务类型
	checkRuleType : [
		['0', '个人征信'],
		['1', '企业征信']
	],
	
	//校验方式
	validType : [
		['SQL', 'SQL语句'],
		['PROCEDURE', '存储']
	],
	
	//是否启用
	isUse : [
		['0', '否'],
		['1', '是']
	],
	//个人证件类型
	idType : [
		['1', '户口簿'],
		['2', '护照'],
		['5', '港澳居民来往内地通行证'],
		['6', '台湾同胞来往内地通行证'],
		['8', '外国人居留证'],
		['9', '警官证'],
		['A', '香港身份证'],
		['B', '澳门身份证'],
		['C', '台湾身份证'],
		['X', '其他证件'],
		['10', '居民身份证及其他以公民身份证号为标识的证件'],
		['20', '军人身份证件']
	],
	//模块名字
	moKuaiName : [
		['I1', '个人基本信息'],
		['I2', '个人证件有效期'],
		['I3', '家族关系信息记录'],
		['I4', '个人授信协议信息记录'],
		['I5', '个人担保账户信息记录'],
		['I6', '个人借贷账户信息记录'],
		['I7', '借贷特殊事件说明'],
		['E1', '企业基本信息记录'],
		['E2', '事业单位收入支出'],
		['E3', '企业间关联关系信息'],
		['E4', '企业借贷信息'],
		['E5', '企业担保信息'],
		['E6', '企业授信协议信息记录'],
		['E7', '企业资产负债信息'],
		['E8', '企业现金流量信息'],
		['E9', '企业利润及利润分配'],
		['E10', '事业单位资产负债'],
		['M1', '抵质押合同']
	],
	 //Resue-个人证件类型
        idTypes: [
            {'value': '1', 'name': '户口簿'},
            {'value': '2', 'name': '护照'},
            {'value': '5', 'name': '港澳居民来往内地通行证'},
            {'value': '6', 'name': '台湾同胞来往内地通行证'},
            {'value': '8', 'name': '外国人居留证'},
            {'value': '9', 'name': '警官证'},
            {'value': 'A', 'name': '香港身份证'},
            {'value': 'B', 'name': '澳门身份证'},
            {'value': 'C', 'name': '台湾身份证'},
            {'value': 'X', 'name': '其他证件'},
            {'value': '10', 'name': '居民身份证及其他以公民身份证号为标识的证件'},
            {'value': '20', 'name': '军人身份证件'}
        ],
	
	//个人客户资料类型
	customerType : [
		['11', '贷款客户资料'],
		['12', '信用卡客户资料'],
		['13', '同时来自信用卡、贷款客户资料'],
		['20', '担保客户资料'],
		['30', '证券类融资客户资料'],
		['40', '融资租赁客户资料'],
		['50', '资产处置客户资料'],
		['60', '垫款业务客户资料'],
		['90', '无法区分具体来源']
	],
	//五级分类标识
	fiveCate : [
	   ['1', '正常'],
	   ['2', '关注'],
       ['3', '次级'],
	   ['4', '可疑'],
	   ['5', '损失'],
	   ['9', '未分类']
	],
	
	//报告时点说明代码
	rptDateCode : [
		['10', '新增客户资料/首次上报'],
		['20', '更新客户资料']
	],
	
	//性别
	sex : [
		['0', '未知的性别'],
		['1', '男'],
		['2', '女'],
		['9', '未说明的性别']
	],
	
	//婚姻状态
	mariStatus : [
		['10', '未婚'],
		['20', '已婚'],
		['21', '初婚'],
		['22', '再婚'],
		['23', '复婚'],
		['30', '丧偶'],
		['40', '离婚'],
		['90', '未说明的婚姻状况'],
		['91', '单身'],
		['99', '未知']
	],
	
	//学历
	eduLevel : [
		['10', '研究生'],
		['20', '本科'],
		['30', '大专'],
		['40', '中专、职高、技校'],
		['60', '高中'],
		['70', '初中'],
		['80', '小学'],
		['90', '其他'],
		['91', '初中及以下'],
		['99', '未知']
	],
	
	//学位
	acaDegree : [
		['1', '名誉博士'],
		['2', '博士'],
		['3', '硕士'],
		['4', '学士'],
		['5', '无'],
		['9', '未知']
	],
	
	//职业代码
	occupation : [
		['0', '国家机关、党群组织、企业、事业单位负责人'],
		['1', '专业技术人员'],
		['3', '办事人员和有关人员'],
		['4', '商业、服务业人员'],
		['5', '农、林、牧、渔、水利业生产人员'],
		['6', '生产、运输设备操作人员及有关人员'],
		['X', '军人'],
		['Y', '不便分类的其他从业人员'],
		['Z', '未知']
	],
	//机构代码
	orgCodeYillion : [
		['1000','总行']],
	
	//职务
	title : [
		['1', '高级领导'],
		['2', '中级领导'],
		['3', '一般员工'],
		['9', '未知']
	],
	
	//职称
	techTitle : [
		['0', '无'],
		['1', '高级'],
		['2', '中级'],
		['3', '初级'],		
		['9', '未知']
	],
	
	//国民经济行业分类
	industry : [
		['A', '农、林、牧、渔业'],
		['B', '采矿业'],
		['C', '制造业'],
		['D', '电力、热力、燃气及水生产和供应业'],
		['E', '建筑业'],
		['F', '批发和零售业'],
		['G', '交通运输、仓储和邮储业'],
		['H', '住宿和餐饮业'],
		['I', '信息传输、 软件和信息技术服务'],
		['J', '金融业'],
		['K', '房地产业'],
		['L', '租赁和商务服务业'],
		['M', '科学研究和技术服务业'],
		['N', '水利、环境和公共设施管理业'],
		['O', '居民服务、修理和其他服务业'],
		['P', '教育'],
		['Q', '卫生和社会工作'],
		['R', '文化、体育和娱乐业'],
		['S', '公共管理、社会保障和社会组织'],
		['T', '国际组织'],
		['9', '未知']
	],
	
	//单位性质
	cpnType : [		
		['10', '机关、事业单位'],
		['20', '国有企业'],
		['30', '外资企业'],
		['40', '个体、私营企业'],
		['50', '其他（包括三资企业、民营企业、民间团体等）'],
		['99', '未知']
	],
	
	//就业状况
	empStatus : [
		['11', '国家公务员'],
		['13', '专业技术人员'],
		['17', '职员'],
		['21', '企业管理人员'],
		['24', '工人'],
		['27', '农民'],
		['31', '学生'],
		['37', '现役军人'],
		['51', '自由职业者'],
		['54', '个体经营者'],
		['70', '无业人员'],
		['80', '退（离）休人员'],
		['90', '其他'],
		['91', '在职'],
		['99', '未知']
	],
	
	//居住状况
	resiStatus : [
		['1', '自置'],
		['2', '按揭'],
		['3', '亲属楼宇'],
		['4', '集体宿舍'],
		['5', '租房'],
		['6', '共有住宅'],
		['7', '其他'],
		['9', '未知'],
		['11', '自有'],
		['12', '借住']
	],
	//个人借贷账户报告时点
	perLoanRptDateCode : [
		['10', '10-新开户'],
		['20', '20-账户关闭'],
		['30', '30-月度结算'],
		['31', '31-月结日首次上报存量账户'],
		['32', '32-月结日账户关闭'],
		['40', '40-收回逾期款项']                    
	],
	//个人借贷交易业务大类
	perLoanBusiLines : [
		['1', '贷款 '],
		['2', '信用卡'],
		['3', '证券类融资'],
		['4', '融资租赁'],
		['5', '资产处置'],
		['6', '垫款']
	],
	//个人借贷交易业务种类细分
	PerLoanBusiDtlLines :[
		['11',	'11-个人住房商业贷款'],
		['12',	'12-个人商用房（含商住两用）贷款'],
		['13',	'13-个人住房公积金贷款          '],
		['21',	'21-个人汽车消费贷款 '],
		['31',	'31-个人助学贷款'],
		['32',	'32-国家助学贷款'],
		['33',	'33-商业助学贷款'],
		['41',	'41-个人经营性贷款'],
		['51',	'51-农户贷款'],
		['52',	'52-经营性农户贷款'],
		['53',	'53-消费性农户贷款'],
		['61',	'61-约定购回式证券交易'],
		['62',	'62-股票质押式回购交易'],
		['63',	'63-融资融券业务'],
		['64',	'64-其他证券类融资'],
		['71',	'71-准贷记卡'],
		['81',	'81-贷记卡'],
		['82',	'82-大额专项分期卡（专指仅用于大额专项分期的贷记卡'],
		['91',	'91-其他个人消费贷款 '],
		['92',	'92-融资租赁业务     '],
		['90',	'90-无法区分具体来源 '],
		['A1',	'由资产处置机构处置的债务'],
		['B1',	'因代偿继承债权的债务'],
		['42',	'个人创业担保贷款']
	],
	//个人借贷账户还款方式（D1账户）
	perLoanRepayModeD1 :[
		['11', '11-分期等额本息'],
		['12', '12-分期等额本金'],
		['13', '13-到期还本分期结息'],
		['14', '14-等比累进分期还款'],
		['15', '15-等额累进分期还款'],
		['19', '19-其他类型分期还款'],
		['21', '21-到期一次还本付息'],
		['22', '22-预先付息到期还本'],
		['23', '23-随时还'],
		['29', '29-其他类型非分期还款'],
		['90', '90-汇总报送，不区分还款方式']		                   
	],
	//个人借贷账户还款方式（R1账户）
	perLoanRepayModeR1 :[
		['31', '31-按期结息，到期还本'],
		['32', '32-按期结息，自由还本'],
		['33', '33-按期计算还本付息'],
		['39', '39-循环贷款下其他还款方式'],
		['90', '90-汇总报送，不区分还款方式']                    
	],
	//个人借贷账户还款方式（R4账户）
	perLoanRepayModeR4 : [
		['11', '11-分期等额本息'],
		['12', '12-分期等额本金'],
		['13', '13-到期还本分期结息'],
		['14', '14-等比累进分期还款'],
		['15', '15-等额累进分期还款'],
		['19', '19-其他类型分期还款'],
		['21', '21-到期一次还本付息'],
		['22', '22-预先付息到期还本'],
		['23', '23-随时还'],
		['29', '29-其他类型非分期还款']
	],
	//企业和个人信息记录类型
	infRecTypePOE :[
		['110', '个人基本信息记录'],
		['120', '家族关系信息记录'],
		['130', '个人证件有效期信息记录'],
		['140', '个人证件整合信息记录'],
		['210', '个人借贷账户信息记录'],
		['220', '个人授信协议信息记录'],
		['230', '个人担保账户信息记录'],
		['215', '个人借贷账户特殊事件说明记录'],
		['211', '个人借贷账户标识变更请求记录 '],
	    ['221', '个人授信协议标识变更请求记录'],
	 	['231', '个人担保账户标识变更请求记录 '],
	 	['212', '个人借贷账户按段更正请求记录 '],
	 	['222', '个人授信账户按段更正请求记录 '],
	 	['232', '个人担保账户按段更正请求记录 '],
	 	['213', '个人借贷账户按段删除请求记录 '],
	 	['223', '个人授信账户按段删除请求记录 '],
	 	['233', '个人担保账户按段删除请求记录 '],
	 	['214', '个人借贷账户整笔删除请求记录 '],
	 	['224', '个人授信账户整笔删除请求记录 '],
	 	['234', '个人担保账户整笔删除请求记录 '],
	 	['114', '个人基本信息整笔删除请求记录 '],
	 	['134', '个人证件有效期整笔删除请求记录 '],
	 	['310', '企业基本信息记录'], 
		['350', '企业间关联关系信息记录 '],
		['410', '企业借贷账户信息记录'],
		['420', '企业授信协议信息记录'],
		['440', '企业担保账户信息记录'],
		['510', '抵（质）押合同信息记录'],
		['610', '企业资产负债表信息记录  '],
		['620', '企业利润及利润分配表信息记录'],
		['630', '企业现金流量表信息记录  '],
		['640', '事业单位资产负债表信息记录'],
		['650', '事业单位收入支出表信息记录'],
		['340', '企业身份标识整合信息记录'],
		['314', '企业基本信息整笔删除请求记录'],
		['411', '企业借贷账户标识变更请求记录'],
		['412', '企业借贷账户按段更正请求记录'],
		['413', '企业借贷账户按段删除请求记录'],
		['414', '企业借贷账户整笔删除请求记录'],
		['421', '企业授信协议标识变更请求记录'],
		['422', '企业授信协议按段更正请求记录'],
		['423', '企业授信协议按段删除请求记录'],
		['424', '企业授信协议整笔删除请求记录'],
		['441', '企业担保账户标识变更请求记录'],
		['442', '企业担保账户按段更正请求记录'],
		['443', '企业担保账户按段删除请求记录'],
		['444', '企业担保账户整笔删除请求记录'],
		['511', '抵（质）押合同标识变更请求记录'],
		['514', '抵（质）押合同整笔删除请求记录'],
		['614', '企业资产负债表整笔删除请求记录'],
		['624', '企业利润及利润分配表整笔删除请求记录'],
		['634', '企业现金流量表整笔删除请求记录'],
		['644', '事业单位资产负债表整笔删除请求记录'],
		['654', '事业单位收入支出表整笔删除请求记录']
	],
	//个人信息记录类型
	infRecTypeIndv :[
		['110', '个人基本信息记录'],
		['120', '家族关系信息记录'],
		['130', '个人证件有效期信息记录'],
		['140', '个人证件整合信息记录'],
		['210', '个人借贷账户信息记录'],
		['220', '个人授信协议信息记录'],
		['230', '个人担保账户信息记录'],
		['215', '个人借贷账户特殊事件说明记录'],
		['211', '个人借贷账户标识变更请求记录 '],
	    ['221', '个人授信协议标识变更请求记录'],
	 	['231', '个人担保账户标识变更请求记录 '],
	 	['212', '个人借贷账户按段更正请求记录 '],
	 	['222', '个人授信账户按段更正请求记录 '],
	 	['232', '个人担保账户按段更正请求记录 '],
	 	['213', '个人借贷账户按段删除请求记录 '],
	 	['223', '个人授信账户按段删除请求记录 '],
	 	['233', '个人担保账户按段删除请求记录 '],
	 	['214', '个人借贷账户整笔删除请求记录 '],
	 	['224', '个人授信账户整笔删除请求记录 '],
	 	['234', '个人担保账户整笔删除请求记录 '],
	 	['114', '个人基本信息整笔删除请求记录 '],
	 	['134', '个人证件有效期整笔删除请求记录 ']
	],
	//个人标识变更
	infortype : [
		['211', '个人借贷账户标识变更请求记录 '],
		['221', '个人授信协议标识变更请求记录'],
		['231', '个人担保账户标识变更请求记录 ']
	],
 
	//更正类报文
	INFOTYPE : [
	      	['211', '个人借贷账户标识变更请求记录 '],
		    ['221', '个人授信协议标识变更请求记录'],
	     	['231', '个人担保账户标识变更请求记录 '],
	     	['212', '个人借贷账户按段更正请求记录 '],
	     	['222', '个人授信账户按段更正请求记录 '],
	     	['232', '个人担保账户按段更正请求记录 '],
	     	['213', '个人借贷账户按段删除请求记录 '],
	     	['223', '个人授信账户按段删除请求记录 '],
	     	['233', '个人担保账户按段删除请求记录 '],
	     	['214', '个人借贷账户整笔删除请求记录 '],
	     	['224', '个人授信账户整笔删除请求记录 '],
	     	['234', '个人担保账户整笔删除请求记录 '],
	     	['114', '个人基本信息整笔删除请求记录 '],
	     	['134', '个人证件有效期整笔删除请求记录 ']
	     	
	     ],
	//信息记录类型
	infRecType : [
		['110', '个人基本信息记录'],
		['120', '家族关系信息记录'],
		['130', '个人证件有效期信息记录'],
		['140', '个人证件整合信息记录'],
		['210', '个人借贷账户信息记录'],
		['215', '个人借贷账户特殊事件说明记录'],
		['220', '个人授信协议信息记录'],
		['230', '个人担保账户信息记录']
	],
	//报送报文类型
	reportMessageType : [
		['110', '个人基本信息记录'],
  		['120', '家族关系信息记录'],
  		['130', '个人证件有效期信息记录'],
  		['140', '个人证件整合信息记录'],
  		['210', '个人借贷账户信息记录'],
  		['220', '个人授信协议信息记录'],
  		['230', '个人担保账户信息记录'],
  		['215', '个人借贷账户特殊事件说明记录']
  	],
	//报送报文状态
  	reportMessageStatus : [
		['10', '待预处理 '],
		['20', '已弃用'],
		['30', '报送成功'],
		['40', '反馈全出错'],
		['41', '反馈成功'],
		['50', '反馈部分出错'],
		['60', '预处理成功'],
		['70', '预处理全失败'],
		['80', '预处理部分失败']        
  ],
	//证件关联关系有效性标识
	assFlg : [
		['0', '无效'],
		['1', '有效']
	],
	//家族关系有效标志
	famRelaAssFlag : [
		['0', '无效'],
		['1', '有效']
	],
	//家族关系
	famRel : [
		['1', '配偶'],
		['2', '子'],
		['3', '女'],
		['4', '孙子、孙女（外孙子、外孙女）'],
		['5', '父母'],
		['6', '祖父母或外祖父母'],
		['7', '兄、弟、姐、妹'],
		['8', '其他']
	],
	
	//个人借贷账户类型
	acctType : [
		['D1', '非循环贷账户'],
		['R1', '循环贷账户'],
		['R2', '贷记卡账户'],
		['R3', '准贷记卡账户'],
		['R4', '循环额度下分账户'],
		['C1', '催收账户']
	],
	
	//借贷业务大类
	busiLines : [
		['1', '贷款'],
		['2', '信用卡'],
		['3', '证券类融资'],
		['4', '融资租赁'],
		['5', '资产处置'],
		['6', '垫款']
	],
	//个人借贷账户还款状态（D1/R4账户）
	rpyStatusD1R4 : [
		['*', '当月不需要还款且之前没有拖欠'],
		['N', '正常还款  '],
		['D', '担保人代还'],
		['Z', '以资抵债  '],
		['M', '约定还款日后月底前还款'],
		['1', '逾期1-30天'],
		['2', '逾期31-60天'],
		['3', '逾期61-90天'],
		['4', '逾期91-120天 '],
		['5', '逾期121-150天'],
		['6', '逾期151-180天'],
		['7', '逾期180天以上'],
		['B', '呆账（长期不还款）'],
		['C', '结清'],
		['G', '结束'],
		['#', '未知']
	],
	//个人借贷账户还款状态（R1账户）
	rpyStatusR1 : [
		['*', '当月未使用额度且不需要还款'],
		['N', '正常还款 '],
		['D', '担保人代还 '],
		['Z', '以资抵债 '],
		['M', '约定还款日后月底前还款'],
		['1', '逾期1-30天'],
		['2', '逾期31-60天'],
		['3', '逾期61-90天'],
		['4', '逾期91-120天'],
		['5', '逾期121-150天'],
		['6', '逾期151-180天'],
		['7', '逾期180天以上'],
		['B', '呆账（长期不还款）'],
		['C', '正常销户 '],
		['G', '结束'],
		['#', '未知']
	],
	//个人借贷账户还款状态（R2账户）
	rpyStatusR2 : [
		['*', '当月未使用额度且不需要还款'],
		['N', '正常还款'],
		['1', '逾期1-30天'],
		['2', '逾期31-60天'],
		['3', '逾期61-90天'],
		['4', '逾期91-120天'],
		['5', '逾期121-150天'],
		['6', '逾期151-180天'],
		['7', '逾期180天以上'],
		['B', '呆账（长期不还款）'],
		['C', '正常销户'],
		['G', '结束'],
		['#', '未知']              
	],
	//个人借贷账户还款状态（R3账户）
	rpyStatusR3 : [
		['*', '本月没有透支行为且上月该账户没有透支余额'],
		['N', '正常'],
		['1', '透支1-30天'],
		['2', '透支31-60天'],
		['3', '透支61-90天'],
		['4', '透支91-120天'],
		['5', '透支121-150天'],
		['6', '透支151-180天'],
		['7', '透支180 天以上   '],
		['B', '呆账（长期不还款）'],
		['C', '正常销户'],
		['G', '结束'],
		['#', '未知']
	],
	//个人借贷账户特殊交易类型
	perLoanChanTranType : [
		['1', '1-展期'],
		['2', '2-担保人（第三方）代偿 '],
		['3', '3-以资抵债'],
		['4', '4-提前还款'],
		['5', '5-提前结清'],
		['8', '8-司法追偿'],
		['11', '11-债务减免'],
		['12', '12-资产剥离'],
		['13', '13-资产转让'],
		['14', '14-信用卡个性化分期'],
		['15', '15-核销'],
		['16', '16-银行主动延期'],
		['17', '17-强制平仓']
	],
	//个人借贷账户原债务种类
	perLoanOrigDbtCate :[
		['1', '贷款'],
		['2', '信用卡'],
		['3', '证券类融资'],
		['4', '融资租赁'],
		['9', '其他']
	],
	//借贷业务细类
	busiDtlLines : [
		['11', '个人住房商业贷款'],
		['12', '个人商用房（含商住两用）贷款'],
		['13', '个人住房公积金贷款'],
		['21', '个人汽车消费贷款'],
		['31', '个人助学贷款'],
		['32', '国家助学贷款'],
		['33', '商业助学贷款'],
		['41', '个人经营性贷款'],
		['51', '农户贷款'],
		['52', '经营性农户贷款'],
		['53', '消费性农户贷款'],
		['61', '约定购回式证券交易'],
		['62', '股票质押式回购交易'],
		['63', '融资融券业务'],
		['64', '其他证券类融资'],
		['71', '准贷记卡'],
		['81', '贷记卡'],
		['82', '大额专项分期卡（专指仅用于大额专项分期的贷记卡）'],
		['91', '其他个人消费贷款'],
		['92', '融资租赁业务 '],
		['99', '其他贷款'],
		['A1 ', '由资产处置机构处置的债务 '],
		['B1 ', '因代偿继承债权的债务 ']
	],
	//个人授信协议报告时点说明
	perCreditRptDateCode :[
		['10', '10-授信开始'],
		['20', '20-授信到期/失效 '],
		['30', '30-额度调整']
	],
	
	//分次放款标识
	loanFlag : [
		['0', '贷款额度一次性发放'],
		['1', '贷款额度分次发放,且每笔放款对应一个独立的D1账户报送'],
		['2', '贷款额度分次发放,且所有放款使用统一的D1账户合并报送']
	],
	//个人借贷账户特殊事件类型
	perLoanChanEventType : [
		['11', '11-信用卡因调整账单日本月不出单'],
		['12', '12-已注销信用卡账户重启'],
		['21', '21-转出']
	],
	//个人授信协议额度类型
	perCreditLimType : [
		['10', '10-循环贷款额度 '],
		['20', '20-非循环贷款额度'],
		['30', '30-信用卡共享额度'],
		['31', '31-信用卡独立额度']
	],
	//个人借贷账户特殊事件说明生效标志
	perLoanChanEffectiveSign : [
		['0', '无效'],
		['1', '有效']
	],
	//个人借贷信息记录段标
	perLoanUpdInfRecType : [
		['B', '基础段'],
		['C', '基本信息段'],
		['D', '相关还款责任人段'],
		['E', '抵质押物信息段'],
		['F', '授信额度信息段'],
		['G', '初始债权说明段'],
		['H', '月度表现信息段'],
		['I', '大额专项分期信息段'],
		['J', '非月度表现信息段'],
		['K', '特殊交易说明段']
	],
	//个人授信协议记录段标
	perCreditUpdInfRecType : [
		['B', '基础段'],
		['C', '共同受信人信息段'],
		['D', '额度信息段']                 
	],
	//还款方式
	repayMode : [
		['11', '分期等额本息'],
		['12', '分期等额本金'],
		['13', '到期还本分期结息'],
		['14', '等比累进分期还款'],
		['15', '等额累进分期还款'],
		['19', '其他类型分期还款'],
		['21', '到期一次还本付息'],
		['22', '预先付息到期还本'],
		['23', '随时还'],
		['29', '其他类型非分期还款'],
		['31', '按期结息，到期还本'],
		['32', '按期结息，自由还本'],
		['33', '按期还款本息'],
		['39', '循环贷款下其他还款方式'],
		['90', '汇总报送，不区分还款方式 ']
	],
	
	//还款频率
	repayFreqcy : [
		['01', '日'],
		['02', '周'],
		['03', '月'],
		['04', '季'],
		['05', '半年'],
		['06', '年'],
		['07', '一次性'],
		['08', '不定期'],
		['12', '旬'],
		['13', '双周'],
		['14', '双月'],
		['99', '其他']
	],
	//个人借贷账户担保方式
	perLoanGusrMode :[
		['1', '质押 '],
		['2', '抵押'],
		['3', '保证 '],
		['4', '信用/免担保'],
		['5', '组合(含保证) '],
		['6', '组合(不含保证) '],
		['7', '农户联保']                 
	],
	//担保方式
	guarMode : [
		['1', '质押 '],
		['2', '抵押'],
		['3', '保证 '],
		['4', '信用/免担保'],
		['5', '组合(含保证) '],
		['6', '组合(不含保证) '],
		['7', '农户联保'],
		['9', '其他']
	],
	//个人借贷账户其他还款保证方式
	perLoanOthRepyGuarWay :[
		['0', '无 '],
		['1', '保证金'],
		['9', '其他 ']
	],
	//其他还款保证方式
	othRepayGuarWay : [
		['0', '无 '],
		['1', '保证金'],
		['2', '其他 ']
	],
	
	//资产转让标志
	assetTrandFlag : [
		['0', '未转让 '],
		['1', '转让']
	],
	
	//业务经营类型
	fundSou : [
		['1', '自营'],
		['2', '委托'],
		['21', '政府部门委托'],
		['22', '企事业单位委托'],
		['23', '个人委托'],
		['24', '公积金管理中心的委托'],
		['4', '信托'],
		['8', '联合']
	],
	//个人贷款发放形式
	perLoanForm :[
		['1',	'新增'],
		['5',	'其他机构转入'],
		['9',	'其他']
	],
	//债权转移时的还款状态
	initRpySts : [
		['1', '逾期1-30天 '],
		['2', '逾期31-60天'],
		['3', '逾期61-90天'],
		['4', '逾期91-120天'],
		['5', '逾期121-150天'],
		['6', '逾期151-180天'],
		['7', '逾期180天以上'],
		['0', '债务人违约时自动垫款']           
	],
	//贷款发放形式
	loanForm : [
		['1', '新增'],
		['5', '其他机构转入'],
		['9', '其他']
	],
	//是否为首套住房贷款
	firstHouLoanFlag : [
		['01', '01-是'],
		['02', '02-否'],
		['03', '03-未知'],
		['04', '04-未发布差别化住房贷款信贷政策']
	],
	//个人借贷账户状态（D1/R4）
	perLoanAcctStatusD1R4 : [
		['1' ,  '1-正常'],
		['2',   '2-逾期'],
		['3',   '3-关闭'],
		['41', '41-呆账（进入核销认定程序，等待核销 '],
		['42', '42-呆账（已核销)'],
		['6',' 6-担保物不足'],
		['8',' 8-司法追偿']                     
	],
	//个人借贷账户状态（R1账户）
	perLoanAcctStatusR1 : [
		['1', '1-正常'],
		['2', '2-逾期'],
		['3', '3-关闭'],
		['41', '41-呆账（进入核销认定程序，等待核销）'],
		['42', '42-呆账（已核销）'],
		['5', '5-银行止付'],
		['6', '6-担保物不足'],
		['8', '8-司法追偿']                  
	],
	//个人借贷账户状态（R2/R3账户）
	perLoanAcctStatusR2R3 :[
		['1', '1-正常'],
		['31', '31-银行止付'],
		['4', '4-销户'],
		['51', '51-呆账（进入核销认定程序，等待核销）'],
		['52', '52-呆账（已核销）'],
		['6', '6-未激活'],
		['8', '8-司法追偿']              
	],
	//个人借贷账户状态（C1账户）
	perLoanAcctStatusC1 : [
		['1', '催收'],
		['2', '结束']		                    
	],
	//个人借贷账户联保标志
	perLoanWartySign : [
		['0', '单人保证/多人分保 '],
		['1', '联保 ']           
	],
	//个人借贷账户相关还款责任人类型
	perLoanArlpType : [
		['1', '共同借款人'],
		['2', '保证人'],
		['9', '其他']                  
	],
	//授信协议额度循环标志
	creditLimType : [
		['0', '否'],
		['1', '是']
	],
	//授信协议额度状态
	creditConStatus : [
		['1', '有效'],
		['2', '到期/失效']
	],
	//代偿（垫款）标志
	compAdvFlag :[
		['0', '否'],
		['1', '是']
	],
	//身份类别
	infoIdType : [
		['1', '自然人'],
		['2', '组织机构']
	],
	
	//企业身份标识类型
	arlpCertType : [
		['10', '中征码（原贷款卡编码）'],
		['20', '统一社会信用代码'],
		['30', '组织机构代码'],
		['01','工商注册号'],
		['02','事业单位证书号'],
		['03','社会团体登记号'],
		['04','民办非企业登记号'],
		['05','基金会登记号'],
		['06','宗教证书登记号'],
		['41','纳税人识别号（国税）'],
		['42','纳税人识别号（地税）']
	],
	//企业身份标识类型
	entCertMainType : [
		['10', '中征码（原贷款卡编码）'],
		['20', '统一社会信用代码'],
		['30', '组织机构代码']
	],
	//还款责任人类型
	arlpType : [
		['1', '共同借款人'],
		['2', '保证人'],
		['9', '其他']
	],
	
	//联保标识
	wartySign : [
		['0', '单人保证/多人分保'],
		['1', '联保']
	],
	
	//币种
	ccy : [
		['ADP','安道尔比塞塔'],
		['AED','UAE迪拉姆'],
		['AFA','阿富汗尼'],
		['ALL','列克'],
		['AMD','亚美尼亚达姆'],
		['ANG','荷属安的列斯盾'],
		['AOA','宽扎'],
		['ARS','阿根廷比索'],
		['ATS','先令'],
		['AUD','澳大利亚元'],
		['AWG','阿鲁巴盾'],
		['AZM','阿塞拜疆马纳特'],
		['BAM','可自由兑换标记'],
		['BBD','巴巴多斯元'],
		['BDT','塔卡'],
		['BEF','比利时法郎'],
		['BGL','列弗'],
		['BGN','保加利亚列弗'],
		['BHD','巴林第纳尔'],
		['BIF','布隆迪法郎'],
		['BMD','百慕大元'],
		['BND','文莱元'],
		['BOB','玻利瓦尔'],
		['BOV','Mvdol'],
		['BRL','巴西瑞尔'],
		['BSD','巴哈马元'],
		['BTN','努尔特鲁姆'],
		['BWP','普拉'],
		['BYR','白俄罗斯卢布'],
		['BZD','伯利兹元'],
		['CAD','加元'],
		['CDF','刚果法郎'],
		['CHF','瑞士法郎'],
		['CLF','发展单位'],
		['CLP','智利比索'],
		['CNY','人民币元'],
		['COP','哥伦比亚比索'],
		['CRC','哥斯达黎加科朗'],
		['CUP','古巴比索'],
		['CVE','佛得角埃斯库多'],
		['CYP','塞浦路斯镑'],
		['CZK','捷克克朗'],
		['DEM','德国马克'],
		['DJF','即菩提法郎'],
		['DKK','丹麦克朗'],
		['DOP','多米尼加比索'],
		['DZD','阿尔及利亚第纳尔'],
		['EEK','克罗姆'],
		['EGP','埃及镑'],
		['ERN','纳克法'],
		['ESP','西班牙比塞塔'],
		['ETB','埃塞俄比亚比尔'],
		['EUR','欧元'],
		['FIM','马克'],
		['FJD','斐济元'],
		['FKP','福克兰群岛镑'],
		['FRF','法国法郎'],
		['GBP','英镑'],
		['GEL','拉里'],
		['GHC','赛地'],
		['GIP','直布罗陀镑'],
		['GMD','达拉西'],
		['GNF','几内亚法郎'],
		['GRD','德拉克马'],
		['GTQ','格查尔'],
		['GWP','几内亚比绍比索'],
		['GWD','圭亚那元'],
		['HKD','香港元'],
		['HNL','伦皮拉'],
		['HRK','克罗地亚库纳'],
		['HTG','古德'],
		['HUF','福林'],
		['IDR','卢比'],
		['IEP','爱尔兰镑'],
		['ILS','新谢克尔'],
		['INR','印度卢比'],
		['IQD','伊拉克第纳尔'],
		['IRR','伊朗里亚尔'],
		['ISK','冰岛克朗'],
		['ITL','意大利里拉'],
		['JMD','牙买加元'],
		['JOD','约旦第纳尔'],
		['JPY','日元'],
		['KES','肯尼亚先令'],
		['KGS','索姆'],
		['KHR','瑞尔'],
		['KMF','科摩罗法郎'],
		['KPW','北朝鲜圆'],
		['KRW','圆'],
		['KWD','科威特第纳尔'],
		['KYD','开曼群岛元'],
		['KZT','坚戈'],
		['LAK','基普'],
		['LBP','黎巴嫩镑'],
		['LKR','斯里兰卡卢比'],
		['LRD','利比里亚元'],
		['LSL','罗提'],
		['LTL','立陶宛'],
		['LUF','卢森堡法郎'],
		['LVL','拉脱维亚拉特'],
		['LYD','利比亚第纳尔'],
		['MAD','摩洛哥迪拉姆'],
		['MDL','摩尔瓦多列伊'],
		['MGF','马尔加什法郎'],
		['MKD','第纳尔'],
		['MMK','缅元'],
		['MNT','图格里克'],
		['MOP','澳门元'],
		['MRO','乌吉亚'],
		['MTL','马尔他里拉'],
		['MUR','毛里求斯卢比'],
		['MVR','卢菲亚'],
		['MWK','克瓦查'],
		['MXN','墨西哥比索'],
		['MXV','墨西哥发展单位'],
		['MYR','马来西亚林吉特'],
		['MZM','麦梯卡尔'],
		['NAD','纳米比亚元'],
		['NGN','奈拉'],
		['NIO','金科多巴'],
		['NLG','荷兰盾'],
		['NOK','挪威克朗'],
		['NPR','尼泊尔卢比'],
		['NZD','新西兰元'],
		['OMR','阿曼里亚尔'],
		['PAB','巴波亚'],
		['PEN','索尔'],
		['PGK','基那'],
		['PHP','菲律宾比索'],
		['PKR','巴基斯坦卢比'],
		['PLN','兹罗提'],
		['PTE','葡萄牙埃斯库多'],
		['PYG','瓜拉尼'],
		['QAR','卡塔尔里亚尔'],
		['ROL','列伊'],
		['RUB','俄罗斯卢布'],
		['RUR','俄罗斯卢布'],
		['RWF','卢旺达法郎'],
		['SAR','沙特里亚尔'],
		['SBD','所罗门群岛元'],
		['SCR','塞舌尔卢比'],
		['SDD','苏丹第纳尔'],
		['SEK','瑞典克朗'],
		['SGD','新加坡元'],
		['SHP','圣赫勒拿镑'],
		['SIT','托拉尔'],
		['SKK','斯洛伐克克朗'],
		['SLL','利昂'],
		['SOS','索马里先令'],
		['SRG','苏里南盾'],
		['STD','多布拉'],
		['SVC','萨尔瓦多科朗'],
		['SYP','叙利亚镑'],
		['SZL','里兰吉尼'],
		['THB','铢'],
		['TJS','索莫尼'],
		['TMM','马纳特'],
		['TND','突尼斯第纳尔'],
		['TOP','邦加'],
		['TPE','东帝汶埃斯库多'],
		['TRL','土耳其里拉'],
		['TTD','特立尼达和多巴哥元'],
		['TWD','新台湾元'],
		['TZS','坦桑尼亚先令'],
		['UAH','格里夫纳'],
		['UGX','乌干达先令'],
		['USD','美元'],
		['UYU','乌拉圭比索'],
		['UZS','乌兹别克斯坦苏姆'],
		['VND','盾'],
		['VUV','瓦图'],
		['WST','塔拉'],
		['XAF','中非法郎'],
		['XAG','银'],
		['XAU','黄金'],
		['XBA','欧洲货币合成单位'],
		['XBB','欧洲货币单位(E.M.U.','6)'],
		['XBC','欧洲账户9单位'],
		['XBD','欧洲账户17单位'],
		['XCD','东加勒比元'],
		['XDR','特别提款权'],
		['XFO','黄金法郎'],
		['XFU','UIC法郎'],
		['XOF','CFA法郎BCEAO'],
		['XPF','CFP法郎'],
		['YER','也门里亚尔'],
		['YUM','南斯拉夫第纳尔'],
		['ZAR','兰特'],
		['ZMK','克瓦查'],
		['ZWD','津巴布韦元']
	],
	
	//世界各国和地区名称
	country : [
		['991', '中国（含港澳台）'],
		['992', '外国（不含港澳台）'],
		['999', '未知'],
		['ABW', '阿鲁巴'],
		['AFG', '阿富汗'],
		['AGO', '安哥拉'],
		['AIA', '安圭拉'],
		['ALB', '阿尔巴尼亚'],
		['AND', '安道尔'],
		['ANT', '荷属安的列斯'],
		['ARE', '阿联酋'],
		['ARG', '阿根廷'],
		['ARM', '亚美尼亚'],
		['ASM', '美属萨摩亚'],
		['ATA', '南极洲'],
		['ATF', '法属南部领土'],
		['ATG', '安提瓜和巴布达'],
		['AUS', '澳大利亚'],
		['AUT', '奥地利'],
		['AZE', '阿塞拜疆'],
		['BDI', '布隆迪'],
		['BEL', '比利时'],
		['BEN', '贝宁'],
		['BFA', '布基纳法索'],
		['BGD', '孟加拉国'],
		['BGR', '保加利亚'],
		['BHR', '巴林'],
		['BHS', '巴哈马'],
		['BIH', '波黑'],
		['BLR', '白俄罗斯'],
		['BLZ', '伯利兹'],
		['BMU', '百慕大'],
		['BOL', '玻利维亚'],
		['BRA', '巴西'],
		['BRB', '巴巴多斯'],
		['BRN', '文莱'],
		['BTN', '不丹'],
		['BVT', '布维岛'],
		['BWA', '博茨瓦纳'],
		['CAF', '中非'],
		['CAN', '加拿大'],
		['CCK', '科科斯(基林)群岛'],
		['CHE', '瑞士'],
		['CHL', '智利'],
		['CHN', '中国'],
		['CIV', '科特迪瓦'],
		['CMR', '喀麦隆'],
		['COD', '刚果（金）'],
		['COG', '刚果(布)'],
		['COK', '库克群岛'],
		['COL', '哥伦比亚'],
		['COM', '科摩罗'],
		['CPV', '佛得角'],
		['CRI', '哥斯达黎加'],
		['CUB', '古巴'],
		['CXR', '圣诞岛'],
		['CYM', '开曼群岛'],
		['CYP', '塞浦路斯'],
		['CZE', '捷克'],
		['DEU', '德国'],
		['DJI', '吉布提'],
		['DMA', '多米尼克'],
		['DNK', '丹麦'],
		['DOM', '多米尼加'],
		['DZA', '阿尔及利亚'],
		['ECU', '厄瓜多尔'],
		['EGY', '埃及'],
		['ERI', '厄立特里亚'],
		['ESH', '西撒哈拉'],
		['ESP', '西班牙'],
		['EST', '爱沙尼亚'],
		['ETH', '埃塞俄比亚'],
		['FIN', '芬兰'],
		['FJI', '斐济'],
		['FLK', '福克兰群岛（马尔维纳斯）'],
		['FRA', '法国'],
		['FRO', '法罗群岛'],
		['FSM', '密克罗尼西亚联邦'],
		['GAB', '加蓬'],
		['GBR', '英国'],
		['GEO', '格鲁吉亚'],
		['GHA', '加纳'],
		['GIB', '直布罗陀'],
		['GIN', '几内亚'],
		['GLP', '瓜德罗普'],
		['GMB', '冈比亚'],
		['GNB', '几内亚比绍'],
		['GNQ', '赤道几内亚'],
		['GRC', '希腊'],
		['GRD', '格林纳达'],
		['GRL', '格陵兰'],
		['GTM', '危地马拉'],
		['GUF', '法属圭亚那'],
		['GUM', '关岛'],
		['GUY', '圭亚那'],
		['HKG', '香港'],
		['HMD', '赫德岛和麦克唐纳岛'],
		['HND', '洪都拉斯'],
		['HRV', '克罗地亚'],
		['HTI', '海地'],
		['HUN', '匈牙利'],
		['IDN', '印度尼西亚'],
		['IND', '印度'],
		['IOT', '英属印度洋领地'],
		['IRL', '爱尔兰'],
		['IRN', '伊朗'],
		['IRQ', '伊拉克'],
		['ISL', '冰岛'],
		['ISR', '以色列'],
		['ITA', '意大利'],
		['JAM', '牙买加'],
		['JOR', '约旦'],
		['JPN', '日本'],
		['KAZ', '哈萨克斯坦'],
		['KEN', '肯尼亚'],
		['KGZ', '吉尔吉斯斯坦'],
		['KHM', '柬埔寨'],
		['KIR', '基里巴斯'],
		['KNA', '圣基茨和尼维斯'],
		['KOR', '韩国'],
		['KWT', '科威特'],
		['LAO', '老挝'],
		['LBN', '黎巴嫩'],
		['LBR', '利比里亚'],
		['LBY', '利比亚'],
		['LCA', '圣卢西亚'],
		['LIE', '列支敦士登'],
		['LKA', '斯里兰卡'],
		['LSO', '莱索托'],
		['LTU', '立陶宛'],
		['LUX', '卢森堡'],
		['LVA', '拉脱维亚'],
		['MAC', '澳门'],
		['MAR', '摩洛哥'],
		['MCO', '摩纳哥'],
		['MDA', '摩尔多瓦'],
		['MDG', '马达加斯加'],
		['MDV', '马尔代夫'],
		['MEX', '墨西哥'],
		['MHL', '马绍尔群岛'],
		['MKD', '前南马其顿'],
		['MLI', '马里'],
		['MLT', '马耳他'],
		['MMR', '缅甸'],
		['MNG', '蒙古'],
		['MNP', '北马里亚纳'],
		['MOZ', '莫桑比克'],
		['MRT', '毛里塔尼亚'],
		['MSR', '蒙特赛拉特'],
		['MTQ', '马提尼克'],
		['MUS', '毛里求斯'],
		['MWI', '马拉维'],
		['MYS', '马来西亚'],
		['MYT', '马约特'],
		['NAM', '纳米比亚'],
		['NCL', '新喀里多尼亚'],
		['NER', '尼日尔'],
		['NFK', '诺福克岛'],
		['NGA', '尼日利亚'],
		['NIC', '尼加拉瓜'],
		['NIU', '纽埃'],
		['NLD', '荷兰'],
		['NOR', '挪威'],
		['NPL', '尼泊尔'],
		['NRU', '瑙鲁'],
		['NZL', '新西兰'],
		['OMN', '阿曼'],
		['OTH', '其他地区'],
		['PAK', '巴基斯坦'],
		['PAN', '巴拿马'],
		['PCN', '皮特凯恩'],
		['PER', '秘鲁'],
		['PHL', '菲律宾'],
		['PLW', '帕劳'],
		['PNG', '巴布亚新几内亚'],
		['POL', '波兰'],
		['PRI', '波多黎各'],
		['PRK', '朝鲜'],
		['PRT', '葡萄牙'],
		['PRY', '巴拉圭'],
		['PSE', '巴勒斯坦'],
		['PYF', '法属波利尼西亚'],
		['QAT', '卡塔尔'],
		['REU', '留尼汪'],
		['ROM', '罗马尼亚'],
		['RUS', '俄罗斯联邦'],
		['RWA', '卢旺达'],
		['SAU', '沙特阿拉伯'],
		['SDN', '苏丹'],
		['SEN', '塞内加尔'],
		['SGP', '新加坡'],
		['SGS', '南乔治亚岛和南桑德韦奇岛'],
		['SHN', '圣赫勒拿'],
		['SJM', '斯瓦尔巴岛和扬马延岛'],
		['SLB', '所罗门群岛'],
		['SLE', '塞拉里昂'],
		['SLV', '萨尔瓦多'],
		['SMR', '圣马力诺'],
		['SOM', '索马里'],
		['SPM', '圣皮埃尔和密克隆'],
		['STP', '圣多美和普林西比'],
		['SUR', '苏里南'],
		['SVK', '斯洛伐克'],
		['SVN', '斯洛文尼亚'],
		['SWE', '瑞典'],
		['SWZ', '斯威士兰'],
		['SYC', '塞舌尔'],
		['SYR', '叙利亚'],
		['TCA', '特克斯和凯科斯群岛'],
		['TCD', '乍得'],
		['TGO', '多哥'],
		['THA', '泰国'],
		['TJK', '塔吉克斯坦'],
		['TKL', '托克劳'],
		['TKM', '土库曼斯坦'],
		['TMP', '东帝汶'],
		['TON', '汤加'],
		['TTO', '特立尼达和多巴哥'],
		['TUN', '突尼斯'],
		['TUR', '土耳其'],
		['TUV', '图瓦卢'],
		['TWN', '台湾'],
		['TZA', '坦桑尼亚'],
		['UGA', '乌干达'],
		['UKR', '乌克兰'],
		['UMI', '美国本土外小岛屿'],
		['URY', '乌拉圭'],
		['USA', '美国'],
		['UZB', '乌兹别克斯坦'],
		['VAT', '梵蒂冈'],
		['VCT', '圣文森特和格林纳丁斯'],
		['VEN', '委内瑞拉'],
		['VGB', '英属维尔京群岛'],
		['VIR', '美属维尔京群岛'],
		['VNM', '越南'],
		['VUT', '瓦努阿图'],
		['WLF', '瓦利斯和富图纳'],
		['WSM', '萨摩亚'],
		['YEM', '也门'],
		['YUG', '南斯拉夫'],
		['ZAF', '南非'],
		['ZMB', '赞比亚'],
		['ZWE', '津巴布韦']		
	],
	//授信额度类型
	creditLimType : [
    	['10', '循环贷款额度'],
    	['20', '非循环贷款额度'],
        ['30', '信用卡共享额度'],
        ['31', '信用卡独立额度']
    ],
    //额度循环标志
    limLoopFlg : [
        ['0', '否'],
        ['1', '是']
    ],
    //个人担保账户类型
    perGuarAcctType : [
		['G1', '融资担保账户'],
		['G2', '非融资担保账户']
    ],
    //个人担保账户报告时点说明
    perGuarRptDateCode : [
		['10', '10-新开户/首次上报'],
		['20', '20-账户关闭'],
		['30', '30-在保责任变化'],
		['40', '40-五级分类调整'],
		['50', '50-其他信息变化']
    ],
    //个人担保交易业务大类
    perGuarBusiLines : [
		['1', '融资担保'],
		['2', '非融资担保'],
		['3', '再担保'],
		['4', '保证保险']            
    ],
    //个人担保交易业务种类细分
    perGuarBusiDtilLines : [
		['01', '01-贷款担保'],
		['02', '02-票据承兑担保'],
		['03', '03-贸易融资担保'],
		['04', '04-项目融资担保'],
		['05', '05-信用证担保'],
		['06', '06-其他融资担保'],
		['07', '07-诉讼保全担保'],
		['08', '08-履约担保'],
		['09', '09-其他非融资担保'],
		['10', '10-债券发行担保'],
		['11', '11-再担保'],
		['12', '12-贷款保证保险'],
		['13', '13-个人消费信用保证保险']
	],
	//个人担保账户反担保方式
	perGuarGuarMode : [
		['0', '信用/免担保'],
		['1', '保证'],
		['2', '质押'],
		['3', '抵押'],
		['4', '组合']
	],
	//个人担保账户其他还款保证方式
	perGuarOthRepyGuarWay : [
		['0', '无'],
		['1', '保证金'],
		['9', '其他']
	],
	//个人担保账户状态
	perGuarAcctStatus : [
		['1', '正常'],
		['2', '关闭']
	],
	//个人担保账户相关还款责任人
	perGuarArlpType : [
		['1', '共同债务人'],
		['2', '反担保人'],
		['9', '其他']
	],
	//个人担保账户联保标志
	perGuarWartySign : [
		['0', '单人保证/多人分保'],
		['1', '联保']
	],
	//个人担保信息记录段标
	perGuarUpdInfRecType : [
		['B', '基础段'],
		['C', '基本信息段'],
		['D', '在保责任信息段'],
		['E', '相关还款责任人段'],
		['F', '抵质押物信息段']
	],
    //额度状态
    conStatus : [
        ['1', '有效'],
        ['2', '到期/失效']
     ],
     //短信通知状态
     sendFeedbackState : [
		['N', 'N-请求失败'],
		['X', 'X-解析响应失败'],
		['P', 'P-反馈处理中'],
		['U', 'U-反馈未知'],
		['F', 'F-反馈失败'],
		['S', 'S-反馈成功']
    ],
    //抵押物种类
	 ccPleType : [
		['11', '11-房产'],
		['12', '12-土地使用权（包含土地附着物）'],
		['13', '13-交通运输设备'],
		['14', '14-机器设备'],
		['99', '99-其他']
	 ],
	 //抵押物识别号码类型
	 ccMotgaProptIdtype : [
		['1', '房产权证号'],
		['2', '土地使用权证书号'],
		['3', '建设用地规划许可证号'],
		['4', '交通工具发动机号'],
		['5', '交通工具营运执照号'],
		['6', '机器设备规格型号']
	 ],
	 //评估机构类型
	 ccValOrgType : [
		['1', '自评估'],
		['2', '第三方机构评估']
	 ],
	 //质物种类代码 
	 ccImpType : [
		['11', '11-现金及其等价物'],
		['12', '12-票据'],
		['13', '13-保单'],
		['14', '14-债券'],
		['15', '15-股权'],
		['21', '21-基金'],
		['22', '22-贵金属'],
		['23', '23-应收账款'],
		['24', '24-流动资产'],
		['25', '25-无形资产'],
		['26', '26-涉农质物'],
		['90', '90-其他']
	 ],
	 //债务人身份标识类型
	 certType : [
		['1', '户口簿'],
		['2', '护照'],
		['5', '港澳居民来往内地通行证'],
		['6', '台湾同胞来往内地通行证'],
		['8', '外国人居留证'],
		['9', '警官证'],
		['A', '香港身份证'],
		['B', '澳门身份证'],
		['C', '台湾身份证'],
		['X', '其他证件'],
		['10', '居民身份证及其他以公民身份证号为标识的证件'],
		['20', '军人身份证件'],
		['10', '中征码（原贷款卡编码）'],
		['20', '统一社会信用代码'],
		['30', '组织机构代码']
    ],
    //抵质押正常报文类型
    moInFrecType : [
        ['510', '抵（质）押合同信息记录']
    ],
    //抵质押更正类信息记录类型
	 motgaInfrectype : [
		['514', '抵（质）押合同整笔删除请求记录'],
		['511', '抵（质）押合同标识变更请求记录']
	 ],
    //数据状态
    businessStates : [
	    ['11','11-待校验'],
		['10','10-校验失败'],
		['20','20-校验成功'],
		['30','30-审核通过'],
		['40','40-审核拒绝'],
		['50','50-已生成报文'],
		['60','60-已上报'],
		['70','70-上报成功'],
		['80','80-反馈错误'],
		['85','85-审核成功后生成报文中前'],
		['90','90-生成报文中'],
		['100','100-审核中'],
		['110','110-预处理错误'],
		['120','120-预处理成功']
	   ],
     //异议信息类型
        objectionType: [
            ['1', '个人基本信息'],
            ['2', '个人借贷交易信息']
        ],
        //异议信息段-个人基本信息
        objectionSegment: [
            ['10', '基础段'],
            ['11', '其他标识段'],
            ['12', '基本概况段'],
            ['13', '婚姻信息段'],
            ['14', '教育信息段'],
            ['15', '职业信息段'],
            ['16', '居住地址段'],
            ['17', '通讯地址段'],
            ['18', '收入信息段'],
            ['20', '基础段'],
            ['21', '基本信息段'],
            ['22', '相关还款责任人段'],
            ['23', '抵质押物信息段'],
            ['24', '授信额度信息段'],
            ['25', '初始债券说明段'],
            ['26', '月度表现信息段'],
            ['27', '大额专项分期信息段'],
            ['28', '非月度表现段'],
            ['29', '特殊交易说明段']
        ],
        //异议信息段-个人借贷交易信息
        objectionSegment2: [],
        //异议状态
        objectionStatus: [
            ['10', '异议登记'],
            ['20', '资料核查'],
            ['30', '异议审核'],
            ['40', '异议审批'],
            ['50', '数据更正'],
            ['60', '处理完成'],
            ['70', '异议拒绝']
        ],
        //是否标注
        isLabel: [
            ['0', '否'],
            ['1', '是']
        ],
        //监控预警-借新还旧撤销预警处理标识
        bntrotcMark: [
            ['N', '未处理'],
            ['Y', '已处理']
        ],
        //监控预警-还款日延期预警处理标识
        payDateExtMark: [
            ['0', '未处理'],
            ['1', '系统已处理'],
            ['2', '人工已处理']
        ],
        //个人异议处理-核查结果代码
        checkResult: [
            ['1', '数据有误'],
            ['2', '数据无误'],
            ['3', '数据遗漏'],
            ['4', '数据删除'],
            ['5', '数据删除(欺诈)']
        ],
        checkResults: [
            {'value': '1', 'name': '数据有误'},
            {'value': '2', 'name': '数据无误'},
            {'value': '3', 'name': '数据遗漏'},
            {'value': '4', 'name': '数据删除'},
            {'value': '5', 'name': '数据删除(欺诈)'}
        ],
        //个人异议处理-个人业务种类代码
        businessType: [
            ['11', '个人住房商业贷款'],
            ['12', '个人商用房（含商住两用）贷款'],
            ['13', '个人住房公积金贷款'],
            ['21', '个人汽车消费贷款'],
            ['31', '个人助学贷款'],
            ['32', '国家助学贷款'],
            ['33', '商业助学贷款'],
            ['41', '个人经营性贷款'],
            ['51', '农户贷款'],
            ['52', '经营性农户贷款'],
            ['53', '消费性农户贷款'],
            ['61', '约定购回式证券交易'],
            ['62', '股票质押式回购交易'],
            ['63', '融资融券业务'],
            ['64', '其他证券类融资'],
            ['71', '准贷记卡'],
            ['81', '贷记卡'],
            ['82', '大额专项分期卡'],
            ['91', '其他个人消费贷款'],
            ['92', '融资租赁业务'],
            ['A1', '由资产处置机构催收的业务'],
            ['B1', '因代偿继承债权的债务']
        ],
        //Resue-个人异议处理-个人业务种类代码
        businessTypes: [
            {'value': '11', 'name': '个人住房商业贷款'},
            {'value': '12', 'name': '个人商用房（含商住两用）贷款'},
            {'value': '13', 'name': '个人住房公积金贷款'},
            {'value': '21', 'name': '个人汽车消费贷款'},
            {'value': '31', 'name': '个人助学贷款'},
            {'value': '32', 'name': '国家助学贷款'},
            {'value': '33', 'name': '商业助学贷款'},
            {'value': '41', 'name': '个人经营性贷款'},
            {'value': '51', 'name': '农户贷款'},
            {'value': '52', 'name': '经营性农户贷款'},
            {'value': '53', 'name': '消费性农户贷款'},
            {'value': '61', 'name': '约定购回式证券交易'},
            {'value': '62', 'name': '股票质押式回购交易'},
            {'value': '63', 'name': '融资融券业务'},
            {'value': '64', 'name': '其他证券类融资'},
            {'value': '71', 'name': '准贷记卡'},
            {'value': '81', 'name': '贷记卡'},
            {'value': '82', 'name': '大额专项分期卡'},
            {'value': '91', 'name': '其他个人消费贷款'},
            {'value': '92', 'name': '融资租赁业务'},
            {'value': 'A1', 'name': '由资产处置机构催收的业务'},
            {'value': 'B1', 'name': '因代偿继承债权的债务'}
        ],
        //个人异议处理-个人定位信息类别代码
        locateInfType: [
            ['1', '性别'],
            ['2', '出生日期'],
            ['3', '婚姻状况'],
            ['4', '就业状况'],
            ['5', '学历'],
            ['6', '学位'],
            ['7', '国籍'],
            ['8', '电子邮箱'],
            ['9', '通讯地址'],
            ['10', '户籍地址'],
            ['11', '手机号码'],
            ['12', '配偶信息'],
            ['13', '居住信息'],
            ['14', '职业信息'],
            ['20', '个人借贷账户'],
            ['21', '个人授信协议'],
            ['22', '相关还款责任信息-个人借贷账户'],
            ['23', '相关还款责任信息-个人担保账户'],
            ['34', '相关还款责任信息-企业借贷账户'],
            ['25', '相关还款责任信息-企业担保账户'],
            ['30', '机构查询记录'],
            ['31', '信息遗漏']
        ],
        //个人异议处理-个人定位信息类别代码
        locateInfTypes: [
            {'value': '1', 'name': '性别'},
            {'value': '2', 'name': '出生日期'},
            {'value': '3', 'name': '婚姻状况'},
            {'value': '4', 'name': '就业状况'},
            {'value': '5', 'name': '学历'},
            {'value': '6', 'name': '学位'},
            {'value': '7', 'name': '国籍'},
            {'value': '8', 'name': '电子邮箱'},
            {'value': '9', 'name': '通讯地址'},
            {'value': '10', 'name': '户籍地址'},
            {'value': '11', 'name': '手机号码'},
            {'value': '12', 'name': '配偶信息'},
            {'value': '13', 'name': '居住信息'},
            {'value': '14', 'name': '职业信息'},
            {'value': '20', 'name': '个人借贷账户'},
            {'value': '21', 'name': '个人授信协议'},
            {'value': '22', 'name': '相关还款责任信息-个人借贷账户'},
            {'value': '23', 'name': '相关还款责任信息-个人担保账户'},
            {'value': '34', 'name': '相关还款责任信息-企业借贷账户'},
            {'value': '25', 'name': '相关还款责任信息-企业担保账户'},
            {'value': '30', 'name': '机构查询记录'},
            {'value': '31', 'name': '信息遗漏'}
        ],
        //个人异议处理-是否存在附件
        existAnnex: [
            ['Y', '是'],
            ['N', '否']
        ],
        //Reuse-个人异议处理-是否存在附件
        existAnnexs: [
            {'value': 'Y', 'name': '是'},
            {'value': 'N', 'name': '否'}
        ],
//个人异议处理-通用、专用处理信息代码
        universalCode: [
            ['AAA000', '处理成功'],
            ['ATO001', '系统繁忙'],
            ['ATO002', '请求正在处理中尚未处理完毕，请稍后再试'],
            ['ATO003', '通信异常'],
            ['ATO004', '数据库错误'],
            ['ATO005', '系统错误'],
            ['ATO999', '其它错误'],
            ['ABE001', '接口密码错误'],
            ['ABE002', '接口用户在征信系统中不存在'],
            ['ABE003', '接口用户没有操作权限'],
            ['ABE004', '接口用户被锁定'],
            ['ABO001', '系统当前非工作状态'],
            ['ABO002', '对于一组可出现多次的数据项，其出现次数必须与其个数相匹配且内容不能重复'],
            ['ABM001', '报文头长度错误'],
            ['ABM002', '报文头的字符不合法'],
            ['ABM003', '报文头中起始标识校验错误'],
            ['ABM004', '报文头中报文格式版本号校验错误'],
            ['ABM005', '报文头中报文发送机构代码校验错误'],
            ['ABM006', '报文头中报文接收机构代码校验错误'],
            ['ABM007', '报文头中报文生成时间校验错误'],
            ['ABM008', '报文头中报文类型校验错误'],
            ['ABM009', '报文头中报文标识号校验错误'],
            ['ABM010', '报文头中预留字段校验错误'],
            ['ABM011', '报文头中结束标识校验错误'],
            ['ABF003', '报文体格式错误'],
            ['GBE001', '业务体数据项长度错'],
            ['GBE002', '业务体数据项为空'],
            ['GBE003', '业务体数据项类型错'],
            ['GBE004', '业务体数据项其他错'],
            ['GBE005', '所有日期必须有效'],
            ['GBE006', '开始日期不能大于结束日期'],
            ['GBE007', '结束日期不能大于当前日期'],
            ['GBE008', '异议事项号不存在'],
            ['GBE009', '异议事项流水号不存在'],
            ['GBE010', '异议事项核查结果已反馈'],
            ['GBE011', '异议事项核查结果未审核'],
            ['GBE012', '异议事项核查结果审核未通过'],
            ['GBE013', '数据提供机构与接口用户关系不匹配'],
            ['GBE014', '核查机构与数据提供机构关系不匹配'],
            ['GBE015', '发起机构与数据提供机构关系不匹配'],
            ['GBE016', '数据发生机构与数据提供机构关系不匹配'],
            ['GBE017', '报文发送机构代码与数据提供机构代码不一致']
        ],
        //Reuse-个人异议处理-通用、专用处理信息代码
        universalCodes:
            [
                {'value': 'AAA000', 'name': '处理成功'},
                {'value': 'ATO001', 'name': '系统繁忙'},
                {'value': 'ATO002', 'name': '请求正在处理中尚未处理完毕，请稍后再试'},
                {'value': 'ATO003', 'name': '通信异常'},
                {'value': 'ATO004', 'name': '数据库错误'},
                {'value': 'ATO005', 'name': '系统错误'},
                {'value': 'ATO999', 'name': '其它错误'},
                {'value': 'ABE001', 'name': '接口密码错误'},
                {'value': 'ABE002', 'name': '接口用户在征信系统中不存在'},
                {'value': 'ABE003', 'name': '接口用户没有操作权限'},
                {'value': 'ABE004', 'name': '接口用户被锁定'},
                {'value': 'ABO001', 'name': '系统当前非工作状态'},
                {'value': 'ABO002', 'name': '对于一组可出现多次的数据项，其出现次数必须与其个数相匹配且内容不能重复'},
                {'value': 'ABM001', 'name': '报文头长度错误'},
                {'value': 'ABM002', 'name': '报文头的字符不合法'},
                {'value': 'ABM003', 'name': '报文头中起始标识校验错误'},
                {'value': 'ABM004', 'name': '报文头中报文格式版本号校验错误'},
                {'value': 'ABM005', 'name': '报文头中报文发送机构代码校验错误'},
                {'value': 'ABM006', 'name': '报文头中报文接收机构代码校验错误'},
                {'value': 'ABM007', 'name': '报文头中报文生成时间校验错误'},
                {'value': 'ABM008', 'name': '报文头中报文类型校验错误'},
                {'value': 'ABM009', 'name': '报文头中报文标识号校验错误'},
                {'value': 'ABM010', 'name': '报文头中预留字段校验错误'},
                {'value': 'ABM011', 'name': '报文头中结束标识校验错误'},
                {'value': 'ABF003', 'name': '报文体格式错误'},
                {'value': 'GBE001', 'name': '业务体数据项长度错'},
                {'value': 'GBE002', 'name': '业务体数据项为空'},
                {'value': 'GBE003', 'name': '业务体数据项类型错'},
                {'value': 'GBE004', 'name': '业务体数据项其他错'},
                {'value': 'GBE005', 'name': '所有日期必须有效'},
                {'value': 'GBE006', 'name': '开始日期不能大于结束日期'},
                {'value': 'GBE007', 'name': '结束日期不能大于当前日期'},
                {'value': 'GBE008', 'name': '异议事项号不存在'},
                {'value': 'GBE009', 'name': '异议事项流水号不存在'},
                {'value': 'GBE010', 'name': '异议事项核查结果已反馈'},
                {'value': 'GBE011', 'name': '异议事项核查结果未审核'},
                {'value': 'GBE012', 'name': '异议事项核查结果审核未通过'},
                {'value': 'GBE013', 'name': '数据提供机构与接口用户关系不匹配'},
                {'value': 'GBE014', 'name': '核查机构与数据提供机构关系不匹配'},
                {'value': 'GBE015', 'name': '发起机构与数据提供机构关系不匹配'},
                {'value': 'GBE016', 'name': '数据发生机构与数据提供机构关系不匹配'},
                {'value': 'GBE017', 'name': '报文发送机构代码与数据提供机构代码不一致'}
            ],
        //个人异议处理-异议更正结果
        correctResults:
            [
                {'value': '1', 'name': '已更正'},
                {'value': '2', 'name': '无需更正'}
	   ],

	//错误信息获取来源
	errorInfoResource:
		[
	        ['0', '校验程序.bad文件'],
	        ['1', '人行反馈错误文件']
        ]

};
